export const taisho_da_1=`冊欄行	大正藏第一冊第1經 T01n001
001b08	佛说长阿含经卷第一
001b09	
001b10	後秦弘始年佛陀耶舍共竺佛念译
001b11	1 分1 大本经一第一分初大本经第一
001b12	如是我闻一时佛在舍卫国祇树花林
001b13	窟与大比丘众千二百五十人俱时诸比丘
001b14	於乞食後集花林堂各共议言诸贤比丘
001b15	唯无上尊为最奇特神通远达威力弘大
001b16	乃知过去无数诸佛入於涅槃断诸结使
001b17	消灭戯论又知彼佛劫数多少名号姓字
001b18	所生种族其所饮食寿命脩短所更苦乐
001b19	又知彼佛有如是戒有如是法有如是慧
001b20	有如是解有如是住云何诸贤如来为善
001b21	别法性知如是事为诸天来语乃知此事
001b22	尔时世尊在闲静处天耳清淨闻诸比丘
001b23	作如是议即从座起诣花林堂就座而
001b24	坐尔时世尊知而故问谓诸比丘汝等集
001b25	此何所语议时诸比丘具以事答尔时世
001b26	尊告诸比丘善哉善哉汝等以平等信出
001b27	家修道诸所应行凡有二业一曰贤圣讲法
001b28	二曰贤圣默然汝等所论正应如是如来
001b29	神通威力弘大尽知过去无数劫事以能
001c01	善解法性故知亦以诸天来语故知佛时
001c02	颂曰
001c03	比丘集法堂讲说贤圣论
001c04	如来处静室天耳尽闻知
001c05	佛日光普照分别法界义
001c06	亦知过去事三佛般泥洹
001c07	名号姓种族受生分亦知
001c08	随彼之处所淨眼皆记之
001c09	诸天大威力容貌甚端严
001c10	亦来启告我三佛般泥洹
001c11	记生名号姓哀鸾音尽知
001c12	无上天人尊记於过去佛
001c13	又告诸比丘汝等欲闻如来识宿命智知
001c14	於过去诸佛因缘不我当说之时诸比丘
001c15	白言世尊今正是时愿乐欲闻善哉世尊
001c16	以时讲说当奉行之佛告诸比丘谛听谛
001c17	听善思念之吾当为汝分别解说时诸比
001c18	丘受教而听
001c19	佛告诸比丘过去九十一劫时世有佛名
001c20	毘婆尸如来至真出现于世复次比丘过
001c21	去三十一劫有佛名尸弃如来至真出现
001c22	於世复次比丘即彼三十一劫中有佛名
001c23	毘舍婆如来至真出现於世复次比丘此
001c24	贤劫中有佛名拘楼孙又名拘那含又
001c25	名迦叶我今亦於贤劫中成最正觉佛
001c26	时颂曰
001c27	过九十一劫有毘婆尸佛
001c28	次三十一劫有佛名尸弃
001c29	即於彼劫中毘舍如来出
002a01	今此贤劫中无数那维岁
002a02	有四大仙人愍众生故出
002a03	拘楼孙那含迦叶释迦文
002a04	汝等当知毘婆尸佛时人寿八万岁尸弃佛
002a05	时人寿七万岁毘舍婆佛时人寿六万岁拘
002a06	楼孙佛时人寿四万岁拘那含佛时人寿三
002a07	万岁迦叶佛时人寿二万岁我今出世人寿
002a08	百岁少出多减佛时颂曰
002a09	毘婆尸时人寿八万四千
002a10	尸弃佛时人寿命七万岁
002a11	毘舍婆时人寿命六万岁
002a12	拘楼孙时人寿命四万岁
002a13	拘那含时人寿命三万岁
002a14	迦叶佛时人寿命二万岁
002a15	如我今时人寿命不过百
002a16	毘婆尸佛出刹利种姓拘利若尸弃佛毘
002a17	舍婆佛种姓亦尔拘楼孙佛出婆罗门种
002a18	姓迦叶拘那含佛迦叶佛种姓亦尔我今如
002a19	来至真出刹利种姓名曰瞿昙佛时颂曰
002a20	毘婆尸如来尸弃毘舍婆
002a21	此三等正觉出拘利若姓
002a22	自余三如来出于迦叶姓
002a23	我今无上尊导御诸众生
002a24	天人中第一勇猛姓瞿昙
002a25	前三等正觉出於刹利种
002a26	其後三如来出婆罗门种
002a27	我今无上尊勇猛出刹利
002a28	毘婆尸佛坐波波罗树下成最正觉尸弃
002a29	佛坐分陀利树下成最正觉毘舍婆佛
002b01	坐娑罗树下成最正觉拘楼孙佛坐尸
002b02	利沙树下成最正觉拘那含佛坐乌暂婆
002b03	罗门树下成最正觉迦叶佛坐尼拘律树
002b04	下成最正觉我今如来至真坐鉢多树下
002b05	成最正觉佛时颂曰
002b06	毘婆尸如来往诣波罗树
002b07	即於彼处所得成最正觉
002b08	尸弃分陀树成道灭有原
002b09	毘舍婆如来坐娑罗树下
002b10	获解脱知见神足无所碍
002b11	拘楼孙如来坐尸利沙树
002b12	一切智清淨无染无所着
002b13	拘那含牟尼坐乌暂树下
002b14	即於彼处所灭诸贪忧恼
002b15	迦叶如来坐尼拘楼树下
002b16	即於彼处所除灭诸有本
002b17	我今释迦文坐於鉢多树
002b18	如来十力尊断灭诸结使
002b19	摧伏众魔怨在众演大明
002b20	七佛精进力放光灭闇冥
002b21	各各坐诸树於中成正觉
002b22	毘婆尸如来三会说法初会弟子有十六万
002b23	八千人二会弟子有十万人三会弟子有
002b24	八万人尸弃如来亦三会说法初会弟子有
002b25	十万人二会弟子有八万人三会弟子有
002b26	七万人毘舍婆如来二会说法初会弟子有
002b27	七万人次会弟子有六万人拘楼孙如来一
002b28	会说法弟子四万人拘那含如来一会说法
002b29	弟子三万人迦叶如来一会说法弟子二万
002c01	人我今一会说法弟子千二百五十人佛时
002c02	颂曰
002c03	毘婆尸名观智慧不可量
002c04	遍见无所畏三会弟子众
002c05	尸弃光无动能灭诸结使
002c06	无量大威德无能测量者
002c07	彼佛亦三会弟子普共集
002c08	毘舍婆断结大仙人要集
002c09	名闻於诸方妙法大名称
002c10	二会弟子众普演深奥义
002c11	拘楼孙一会哀愍疗诸苦
002c12	导师化众生一会弟子众
002c13	拘那含如来无上亦如是
002c14	紫磨金色身容貌悉具足
002c15	一会弟子众普演微妙法
002c16	迦叶一一毛一心无乱想
002c17	一语不烦重一会弟子众
002c18	能仁意寂灭释种沙门上
002c19	天中天最尊我一会弟子
002c20	彼会我现义演布清淨教
002c21	心常怀欢喜漏尽尽後有
002c22	毘婆尸弃三毘舍婆佛二
002c23	四佛各各一仙人会演说
002c24	时毘婆尸佛有二弟子一名骞茶二名
002c25	提舍诸弟子中最为第一尸弃佛有二弟
002c26	子一名阿毘浮二名三婆婆诸弟子中
002c27	最为第一毘舍婆佛有二弟子一名扶
002c28	遊二名郁多摩诸弟子中最为第一拘
002c29	楼孙佛有二弟子一名萨尼二名毘楼
003a01	诸弟子中最为第一拘那含佛有二弟子
003a02	一名舒槃那二名郁多楼诸弟子中最为
003a03	第一迦叶佛有二弟子一名提舍二名
003a04	婆罗婆诸弟子中最为第一今我二弟子
003a05	一名舍利弗二名目揵连诸弟子中最
003a06	为第一佛时颂曰
003a07	骞茶提舍等毗婆尸弟子
003a08	阿毗浮三婆尸弃佛弟子
003a09	扶遊郁多摩弟子中第一
003a10	二俱降魔怨毗舍婆弟子
003a11	萨尼毗楼等拘楼孙弟子
003a12	舒槃郁多楼拘那含弟子
003a13	提舍婆罗婆迦叶佛弟子
003a14	舍利弗目连是我第一子
003a15	毗婆尸佛有执事弟子名曰无忧尸弃佛
003a16	执事弟子名曰忍行毗舍婆佛有执事弟
003a17	子名曰寂灭拘楼孙佛有执事弟子名曰
003a18	善觉拘那含佛有执事弟子名曰安和
003a19	迦叶佛有执事弟子名曰善友我执事弟
003a20	子名曰阿难佛时颂曰
003a21	无忧与忍行寂灭及善觉
003a22	安和善友等阿难为第七
003a23	此为佛侍者具足诸义趣
003a24	昼夜无放逸自利亦利他
003a25	此七贤弟子侍七佛左右
003a26	欢喜而供养寂然归灭度
003a27	毗婆尸佛有子名曰方膺尸弃佛有子名
003a28	曰无量毗舍婆佛有子名曰妙觉拘楼孙
003a29	佛有子名曰上胜拘那含佛有子名曰导
003b01	师迦叶佛有子名曰集军今我有子名
003b02	曰罗睺罗佛时颂曰
003b03	方膺无量子妙觉及上胜
003b04	导师集军等罗睺罗第七
003b05	此诸豪贵子绍继诸佛种
003b06	爱法好施惠於圣法无畏
003b07	毗婆尸佛父名槃头刹利王种母名槃头
003b08	婆提王所治城名曰槃头婆提佛时颂曰
003b09	遍眼父槃头母槃头婆提
003b10	槃头婆提城佛於中说法
003b11	尸弃佛父名曰明相刹利王种母名光
003b12	曜王所治城名曰光相佛时颂曰
003b13	尸弃父明相母名曰光曜
003b14	於明相城中威德降外敌
003b15	毗舍婆佛父名善灯刹利王种母名称
003b16	戒王所治城名曰无喻佛时颂曰
003b17	毗舍婆佛父善灯刹利种
003b18	母名曰称戒城名曰无喻
003b19	拘楼孙佛父名祀得婆罗门种母名善
003b20	枝王名安和随王名故城名安和佛时
003b21	颂曰
003b22	祀得婆罗门母名曰善枝
003b23	王名曰安和居在安和城
003b24	拘那含佛父名大德婆罗门种母名善
003b25	胜是时王名清淨随王名故城名清淨
003b26	佛时颂曰
003b27	大德婆罗门母名曰善胜
003b28	王名曰清淨居在清淨城
003b29	迦叶佛父名曰梵德婆罗门种母名曰财
003c01	主时王名汲毗王所治城名波罗●佛
003c02	时颂曰
003c03	梵德婆罗门母名曰财主
003c04	时王名汲毗在波罗●城
003c05	我父名淨饭刹利王种母名大清淨妙
003c06	王所治城名迦毗罗卫佛时颂曰
003c07	父刹利淨饭母名大清淨
003c08	土广民丰饶我从彼而生
003c09	此是诸佛因缘名号种族所出生处何有智
003c10	者闻此因缘而不欢喜起爱乐心尔时
003c11	世尊告诸比丘吾今欲以宿命智说过去
003c12	佛事汝欲闻不诸比丘对曰今正是时
003c13	愿乐欲闻佛告诸比丘谛听谛听善思念
003c14	之吾当为汝分别解说比丘当知诸佛常
003c15	法毗婆尸菩萨从兜率天降神母胎从
003c16	右脇入正念不乱当於尔时地为震动放
003c17	大光明普照世界日月所不及处皆蒙大
003c18	明幽冥众生各相覩见知其所趣时此光明
003c19	复照魔宫诸天释梵沙门婆罗门及余众生
003c20	普蒙大明诸天光明自然不现佛时颂曰
003c21	密云聚虚空电光照天下
003c22	毗婆尸降胎光明照亦然
003c23	日月所不及莫不蒙大明
003c24	处胎淨无秽诸佛法皆然
003c25	诸比丘当知诸佛常法毗婆尸菩萨在母
004a01	胎时专念不乱有四天子执戈矛侍护
004a02	其人人与非人不得侵娆此是常法
004a03	佛时颂曰
004a04	四方四天子有名称威德
004a05	天帝释所遣善守护菩萨
004a06	手常执戈矛卫护不去离
004a07	人非人不娆此诸佛常法
004a08	天神所拥护如天女卫天
004a09	眷属怀欢喜此诸佛常法
004a10	又告比丘诸佛常法毗婆尸菩萨从兜率
004a11	天降神母胎专念不乱母身安隐无众恼
004a12	患智慧增益母自观胎见菩萨身诸根具
004a13	足如紫磨金无有瑕秽犹如有目之士
004a14	观淨琉璃内外清彻无众障翳诸比丘
004a15	此是诸佛常法尔时世尊而说偈言
004a16	如淨琉璃珠其明如日月
004a17	仁尊处母胎其母无恼患
004a18	智慧为增益观胎如金像
004a19	母怀妊安乐此诸佛常法
004a20	佛告比丘毗婆尸菩萨从兜率天降神母
004a21	胎专念不乱母心清淨无众欲想不为婬
004a22	火之所烧然此是诸佛常法尔时世尊而说
004a23	偈言
004a24	菩萨住母胎天终天福成
004a25	其母心清淨无有众欲想
004a26	舍离诸婬欲不染不亲近
004a27	不为欲火燃诸佛母常淨
004a28	佛告比丘诸佛常法毗婆尸菩萨从兜率
004a29	天降神母胎专念不乱其母奉持五戒梵
004b01	行清淨笃信仁爱诸善成就安乐无畏身坏
004b02	命终生忉利天此是常法尔时世尊而说
004b03	偈言
004b04	持人中尊身精进戒具足
004b05	後必受天身此缘名佛母
004b06	佛告比丘诸佛常法毗婆尸菩萨当其生
004b07	时从右脇出地为震动光明普照始入胎
004b08	时闇冥之处无不蒙明此是常法尔时世
004b09	尊而说偈言
004b10	太子生地动大光靡不照
004b11	此界及余界上下与诸方
004b12	放光施淨目具足於天身
004b13	以欢喜淨音转称菩萨名
004b14	佛告比丘诸佛常法毗婆尸菩萨当其生
004b15	时从右脇出专念不乱时菩萨母手攀树
004b16	枝不坐不臥时四天子手奉香水於
004b17	母前立言唯然天母今生圣子勿怀忧慼
004b18	此是常法尔时世尊而说偈言
004b19	佛母不坐臥住戒修梵行
004b20	生尊不懈怠天人所奉侍
004b21	佛告比丘诸佛常法毗婆尸菩萨当其生
004b22	时从右脇出专念不乱其身清淨不为秽
004b23	恶之所汙染犹如有目之士以淨明珠
004b24	投白缯上两不相汙二俱淨故菩萨出胎
004b25	亦复如是此是常法尔时世尊而说偈言
004b26	犹如淨明珠投缯不染汙
004b27	菩萨出胎时清淨无染汙
004b28	佛告比丘诸佛常法毗婆尸菩萨当其生
004b29	时从右脇出专念不乱从右脇出堕地行
004c01	七步无人扶侍遍观四方举手而言天
004c02	上天下唯我为尊要度众生生老病死此
004c03	是常法尔时世尊而说偈言
004c04	犹如师子步遍观於四方
004c05	堕地行七步人师子亦然
004c06	又如大龙行遍观於四方
004c07	堕地行七步人龙亦复然
004c08	两足尊生时安行於七步
004c09	观四方举声当尽生死苦
004c10	当其初生时无等等与等
004c11	自观生死本此身最後边
004c12	佛告比丘诸佛常法毗婆尸菩萨当其生
004c13	时从右脇出专念不乱二泉湧出一温一
004c14	冷以供澡浴此是常法尔时世尊而说偈
004c15	言
004c16	两足尊生时二泉自涌出
004c17	以供菩萨用遍眼浴清淨
004c18	二泉自涌出其水甚清淨
004c19	一温二清冷以浴一切智
004c20	太子初生父王槃头召集相师及诸道术令
004c21	观太子知其吉凶时诸相师受命而观即
004c22	前披衣见有具相占曰有此相者当趣
004c23	二处必然无疑若在家者当为转轮圣王
004c24	王四天下四兵具足以正法治无有偏枉
004c25	恩及天下七宝自至千子勇健能伏外敌
004c26	兵杖不用天下太平若出家学道当成正
004c27	觉十号具足时诸相师即白王言王所生
004c28	子有三十二相当趣二处必然无疑在家
004c29	当为转轮圣王若其出家当成正觉十号
005a01	具足佛时颂曰
005a02	百福太子生相师之所记
005a03	如典记所载趣二处无疑
005a04	若其乐家者当为转轮王
005a05	七宝难可获为王宝自至
005a06	真金千辐具周匝金辋持
005a07	转能飞遍行故名为天轮
005a08	善调七牙住高广白如雪
005a09	能善飞虚空名第二象宝
005a10	马行周天下朝去暮还食
005a11	朱髦孔雀咽名为第三宝
005a12	清淨琉璃珠光照一由旬
005a13	照夜明如昼名为第四宝
005a14	色声香味触无有与等者
005a15	诸女中第一名为第五宝
005a16	献王琉璃宝珠玉及众珍
005a17	欢喜而贡奉名为第六宝
005a18	如转轮王念军众速来去
005a19	健疾如王意名为第七宝
005a20	此名为七宝轮象马纯白
005a21	居士珠女宝典兵宝为七
005a22	观此无有厌五欲自娱乐
005a23	如象断●靽出家成正觉
005a24	王有如是子二足人中尊
005a25	处世转法轮道成无懈怠
005a26	是时父王慇懃再三重问相师汝等更观太
005a27	子三十二相斯名何等时诸相师即披太子
005a28	衣说三十二相一者足安平足下平满蹈
005a29	地安隐二者足下相轮千辐成就光光相照
005b01	三者手足网缦犹如鹅王四者手足柔软犹
005b02	如天衣五者手足指纤长无能及者六者
005b03	足跟充满观视无厌七者鹿腨肠上下●
005b04	直八者钩鎻骨骨节相钩犹如鎻连九者
005b05	阴马藏十者平立垂手过膝十一一一孔
005b06	一毛生其毛右旋绀琉璃色十二毛生右
005b07	旋绀色仰靡十三身黄金色十四皮肤细软
005b08	不受尘秽十五两肩齐亭充满圆好十六
005b09	胸有万字十七身长倍人十八七处平满
005b10	十九身长广等如尼拘卢树二十颊车如
005b11	师子二十一胸膺方整如师子二十二口四
005b12	十齿二十三方整齐平二十四齿密无间二
005b13	十五齿白鲜明二十六咽喉清淨所食众味
005b14	无不称适二十七广长舌左右舐耳二十
005b15	八梵音清彻二十九眼绀青色三十眼如牛
005b16	王眼上下俱眴三十一眉间白毫柔软细泽
005b17	引长一寻放则右旋螺如真珠三十二顶有
005b18	肉髻是为三十二相即说颂曰
005b19	善住柔软足不蹈地迹现
005b20	千辐相庄严光色靡不具
005b21	如尼俱类树纵广正平等
005b22	如来未曾有祕密马阴藏
005b23	金宝庄严身众相互相暎
005b24	虽顺俗流行尘土亦不汙
005b25	天色极柔软天盖自然覆
005b26	梵音身紫金如华始出池
005b27	王以问相师相师敬报王
005b28	称讚菩萨相举身光明具
005b29	手足诸支节中外靡不现
005c01	食味尽具足身正不倾斜
005c02	足下轮相现其音如哀鸾
005c03	●●形相具宿业之所成
005c04	臂肘圆满好眉目甚端严
005c05	人中师子尊威力最第一
005c06	其颊车方整臥脇如师子
005c07	齿方整四十齐密中无间
005c08	梵音未曾有远近随缘到
005c09	平立不倾身二手摩扪膝
005c10	手齐整柔软人尊美相具
005c11	一孔一毛生手足网缦相
005c12	肉髻目绀青眼上下俱眴
005c13	两肩圆充满三十二相具
005c14	足跟无高下鹿腨肠纤●
005c15	天中天来此如象绝●靽
005c16	解脱众生苦处生老病死
005c17	以慈悲心故为说四真谛
005c18	开演法句义令众奉至尊
005c19	佛告比丘毗婆尸菩萨生时诸天在上於
005c20	虚空中手执白盖宝扇以障寒暑风雨尘
005c21	土佛时颂曰
005c22	人中未曾有生於二足尊
005c23	诸天怀敬养奉宝盖宝扇
005c24	尔时父王给四乳母一者乳哺二者澡浴
005c25	三者涂香四者娱乐欢喜养育无有懈倦
005c26	於是颂曰
005c27	乳母有慈爱子生即付养
005c28	一乳哺一浴二涂香娱乐
005c29	世间最妙香以涂人中尊
006a01	为童子时举国士女视无厌足於是颂曰
006a02	多人所敬爱如金像始成
006a03	男女共谛观视之无厌足
006a04	为童子时举国士女众共传抱如观宝
006a05	华於是颂曰
006a06	二足尊生时多人所敬爱
006a07	展转共传抱如观宝花香
006a08	菩萨生时其目不眴如忉利天以不眴
006a09	故名毗婆尸於是颂曰
006a10	天中天不眴犹如忉利天
006a11	见色而正观故号毗婆尸
006a12	菩萨生时其声清彻柔软和雅如迦罗频
006a13	伽鸟声於是颂曰
006a14	犹如雪山鸟饮华汁而鸣
006a15	其彼二足尊声清彻亦然
006a16	菩萨生时眼能彻视见一由旬於是颂曰
006a17	清淨业行报受天妙光明
006a18	菩萨目所见周遍一由旬
006a19	菩萨生时年渐长大在天正堂以道开化
006a20	恩及庶民名德远闻於是颂曰
006a21	童幼处正堂以道化天下
006a22	决断众事务故号毗婆尸
006a23	清淨智广博甚深犹大海
006a24	悦可於群生使智慧增广
006a25	於时菩萨欲出遊观告勅御者严驾宝车
006a26	诣彼园林巡行遊观御者即便严驾讫已
006a27	还白今正是时太子即乘宝车诣彼园观
006a28	於其中路见一老人头白齿落面皱身偻
006a29	拄杖羸步喘息而行太子顾问侍者此为
006b01	何人答曰此是老人又问何如为老答
006b02	曰夫老者生寿向尽余命无几故谓之老
006b03	太子又问吾亦当尔不免此患耶答曰
006b04	然生必有老无有豪贱於是太子怅然不
006b05	悦即告侍者迴驾还宫静默思惟念此
006b06	老苦吾亦当有佛於是颂曰
006b07	见老命将尽拄杖而羸步
006b08	菩萨自思惟吾未免此难
006b09	尔时父王问彼侍者太子出遊欢乐不耶答
006b10	曰不乐又问其故答曰道逢老人是以
006b11	不乐尔时父王默自思念昔日相师占相太
006b12	子言当出家今者不悦得无尔乎当设
006b13	方便使处深宫五欲娱乐以悦其心令
006b14	不出家即便严饰宫舘简择婇女以娱
006b15	乐之佛於是颂曰
006b16	父王闻此言方便严宫舘
006b17	增益以五欲欲使不出家
006b18	又於後时太子复命御者严驾出遊於其
006b19	中路逢一病人身羸腹大面目黧黑独臥粪
006b20	除无人瞻视病甚苦毒口不能言顾问
006b21	御者此为何人答曰此是病人问曰何
006b22	如为病答曰病者众痛迫切存亡无期故
006b23	曰病也又曰吾亦当尔未免此患耶答
006b24	曰然生则有病无有贵贱於是太子怅然
006b25	不悦即告御者迴车还宫静默思惟念
006b26	此病苦吾亦当尔佛於是颂曰
006b27	见彼久病人颜色为衰损
006b28	静默自思惟吾未免此患
006b29	尔时父王复问御者太子出遊欢乐不耶答
006c01	曰不乐又问其故答曰道逢病人是以
006c02	不乐於是父王默然思惟昔日相师占相
006c03	太子言当出家今日不悦得无尔乎吾当
006c04	更设方便增诸伎乐以悦其心使不出
006c05	家即复严饰宫舘简择婇女以娱乐之
006c06	佛於是颂曰
006c07	色声香味触微妙可悦乐
006c08	菩萨福所致故娱乐其中
006c09	又於异时太子复勅御者严驾出遊於其
006c10	中路逢一死人杂色缯幡前後导引宗族
006c11	亲里悲号哭泣送之出城太子复问此为
006c12	何人答曰此是死人问曰何如为死答
006c13	曰死者尽也风先火次诸根坏败存亡异
006c14	趣室家离别故谓之死太子又问御者吾
006c15	亦当尔不免此患耶答曰然生必有死
006c16	无有贵贱於是太子怅然不悦即告御者
006c17	迴车还宫静默思惟念此死苦吾亦当然
006c18	佛时颂曰
006c19	始见有人死知其复更生
006c20	静默自思惟吾未免此患
006c21	尔时父王复问御者太子出遊欢乐不耶答
006c22	曰不乐又问其故答曰道逢死人是故
006c23	不乐於是父王默自思念昔日相师占相
006c24	太子言当出家今日不悦得无尔乎吾当
006c25	更设方便增诸伎乐以悦其心使不出
006c26	家即复严饰宫舘简择婇女以娱乐之
006c27	佛於是颂曰
006c28	童子有名称婇女众围遶
006c29	五欲以自娱如彼天帝释
007a01	又於异时复勑御者严驾出遊於其中
007a02	路逢一沙门法服持鉢视地而行即问御
007a03	者此为何人御者答曰此是沙门又问何
007a04	谓沙门答曰沙门者舍离恩爱出家修道
007a05	摄御诸根不染外欲慈心一切无所伤害
007a06	逢苦不慼遇乐不欣能忍如地故号沙
007a07	门太子曰善哉此道真正永绝尘累微妙
007a08	清虚惟是为快即勑御者迴车就之尔
007a09	时太子问沙门曰剃除须发法服持鉢何
007a10	所志求沙门答曰夫出家者欲调伏心意
007a11	永离尘垢慈育群生无所侵娆虚心静
007a12	寞唯道是务太子曰善哉此道最真寻勑
007a13	御者賷吾宝衣并及乘轝还白大王我即
007a14	於此剃除须发服三法衣出家修道所
007a15	以然者欲调伏心意舍离尘垢清淨自居
007a16	以求道术於是御者即以太子所乘宝车
007a17	及与衣服还归父王太子於後即剃除须
007a18	发服三法衣出家修道佛告比丘太子见
007a19	老病人知世苦恼又见死人恋世情灭及
007a20	见沙门廓然大悟下宝车时步步中间转
007a21	远缚着是真出家是真远离时彼国人闻
007a22	太子剃除须发法服持鉢出家修道咸相谓
007a23	言此道必真乃令太子舍国荣位捐弃所
007a24	重于时国中八万四千人往就太子求为
007a25	弟子出家修道佛时颂曰
007a26	撰择深妙法彼闻随出家
007a27	离於恩爱狱无有众结缚
007a28	于时太子即便纳受与之遊行在在教化
007a29	从村至村从国至国所至之处无不恭
007b01	敬四事供养菩萨念言吾与大众遊行诸国
007b02	人间愦閙此非我宜何时当得离此群众
007b03	闲静之处以求道真寻获志愿於闲静处
007b04	专精修道复作是念众生可愍常处闇冥
007b05	受身危脆有生有老有病有死众苦所
007b06	集死此生彼从彼生此缘此苦阴流转
007b07	无穷我当何时晓了苦阴灭生老死复作
007b08	是念生死何从何缘而有即以智慧观察
007b09	所由从生有老死生是老死缘生从有起
007b10	有是生缘有从取起取是有缘取从爱起
007b11	爱是取缘爱从受起受是爱缘受从触起
007b12	触是受缘触从六入起六入是触缘六入
007b13	从名色起名色是六入缘名色从识起识
007b14	是名色缘识从行起行是识缘行从癡起
007b15	癡是行缘是为缘癡有行缘行有识缘
007b16	识有名色缘名色有六入缘六入有触
007b17	缘触有受缘受有爱缘爱有取缘取有
007b18	有缘有有生缘生有老病死忧悲苦恼此
007b19	苦盛阴缘生而有是为苦集菩萨思惟苦
007b20	集阴时生智生眼生觉生明生通生慧
007b21	生证於时菩萨复自思惟何等无故老死无
007b22	何等灭故老死灭即以智慧观察所由生
007b23	无故老死无生灭故老死灭有无故生无有
007b24	灭故生灭取无故有无取灭故有灭爱无
007b25	故取无爱灭故取灭受无故爱无受灭故
007b26	爱灭触无故受无触灭故受灭六入无故
007b27	触无六入灭故触灭名色无故六入无名
007b28	色灭故六入灭识无故名色无识灭故名色
007b29	灭行无故识无行灭故识灭癡无故行无
007c01	癡灭故行灭是为癡灭故行灭行灭故识
007c02	灭识灭故名色灭名色灭故六入灭六入灭
007c03	故触灭触灭故受灭受灭故爱灭爱灭故取
007c04	灭取灭故有灭有灭故生灭生灭故老死
007c05	忧悲苦恼灭菩萨思惟苦阴灭时生智生
007c06	眼生觉生明生通生慧生证尔时菩萨逆
007c07	顺观十二因缘如实知如实见已即於座
007c08	上成阿耨多罗三藐三菩提佛时颂曰
007c09	此言众中说汝等当善听
007c10	过去菩萨观本所未闻法
007c11	老死从何缘　因何等而有
007c12	如是正观已知其本由生
007c13	生本由何缘　因何事而有
007c14	如是思惟已知生从有起
007c15	取彼取彼已展转更增有
007c16	是故如来说取是有因缘
007c17	如众秽恶聚风吹恶流演
007c18	如是取相因因爱而广普
007c19	爱由於受生起苦罗网本
007c20	以染着因缘苦乐共相应
007c21	受本由何缘　因何而有受
007c22	以是思惟已知受由触生
007c23	触本由何缘　因何而有触
007c24	如是思惟已触由六入生
007c25	六入本何缘　因何有六入
007c26	如是思惟已六入名色生
007c27	名色本何缘　因何有名色
007c28	如是思惟已名色从识生
007c29	识本由何缘　因何而有识
008a01	如是思惟已知识从行生
008a02	行本由何缘　因何而有行
008a03	如是思惟已知行从癡生
008a04	如是因缘者名为实义因
008a05	智慧方便观能见因缘根
008a06	苦非贤圣造亦非无缘有
008a07	是故变易苦智者所断除
008a08	若无明灭尽是时则无行
008a09	若无有行者则亦无有识
008a10	若识永灭者亦无有名色
008a11	名色既已灭即无有诸入
008a12	若诸入永灭则亦无有触
008a13	若触永灭者则亦无有受
008a14	若受永灭者则亦无有爱
008a15	若爱永灭者则亦无有取
008a16	若取永灭者则亦无有有
008a17	若有永灭者则亦无有生
008a18	若生永灭者无老病苦阴
008a19	一切都永尽智者之所说
008a20	十二缘甚深难见难识知
008a21	唯佛能善觉因是有是无
008a22	若能自观察则无有诸入
008a23	深见因缘者更不外求师
008a24	能於阴界入离欲无染者
008a25	堪受一切施淨报施者恩
008a26	若得四辩才获得决定证
008a27	能解众结缚断除无放逸
008a28	色受想行识犹如朽故车
008a29	能谛观此法则成等正觉
008b01	如鸟遊虚空东西随风逝
008b02	菩萨断众结如风靡轻衣
008b03	毗婆尸闲静观察於诸法
008b04	老死何缘有　从何而得灭
008b05	彼作是观已生清淨智慧
008b06	知老死由生生灭老死灭
008b07	毗婆尸佛初成道时多修二观一曰安隐
008b08	观二曰出离观佛於是颂曰
008b09	如来无等等多修於二观
008b10	安隐及出离仙人度彼岸
008b11	其心得自在断除众结使
008b12	登山观四方故号毘婆尸
008b13	大智光除冥如以镜自照
008b14	为世除忧恼尽生老死苦
008b15	毗婆尸佛於闲静处复作是念我今已得
008b16	此无上法甚深微妙难解难见息灭清
008b17	淨智者所知非是凡愚所能及也斯由众
008b18	生异忍异见异受异学依彼异见各乐所
008b19	求各务所习是故於此甚深因缘不能解
008b20	了然爱尽涅槃倍复难知我若为说彼必
008b21	不解更生触扰作是念已即便默然不复
008b22	说法时梵天王知毗婆尸如来所念即自思
008b23	惟念此世间便为败坏甚可哀愍毗婆
008b24	尸佛乃得知此深妙之法而不欲说譬
008b25	如力士屈伸臂顷从梵天宫忽然来下立
008b26	於佛前头面礼足却住一面时梵天王右膝
008b27	着地叉手合掌白佛言唯愿世尊以时说
008b28	法今此众生尘垢微薄诸根猛利有恭敬心
008b29	易可开化畏怖後世无救之罪能灭恶法
008c01	出生善道佛告梵王如是如是如汝所
008c02	言但我於闲静处默自思念所得正法甚
008c03	深微妙若为彼说彼必不解更生触扰故
008c04	我默然不欲说法我从无数阿僧祇劫勤
008c05	苦不懈修无上行今始获此难得之法若
008c06	为婬怒癡众生说者必不承用徒自劳疲
008c07	此法微妙与世相反众生染欲愚冥所覆
008c08	不能信解梵王我观如此是以默然不欲
008c09	说法时梵天王复重劝请慇懃恳恻至于
008c10	再三世尊若不说法今此世间便为坏败
008c11	甚可哀愍唯愿世尊以时敷演勿使众生
008c12	坠落余趣尔时世尊三闻梵王慇懃劝请即
008c13	以佛眼观视世界众生垢有厚薄根有利
008c14	钝教有难易易受教者畏後世罪能灭
008c15	恶法出生善道譬如优鉢罗花鉢头摩华
008c16	鸠勿头华分陀利华或有始出汙泥未
008c17	至水者或有已出与水平者或有出水未
008c18	敷开者然皆不为水所染着易可开敷
008c19	世界众生亦复如是尔时世尊告梵王曰
008c20	吾愍汝等今当开演甘露法门是法深妙
008c21	难可解知今为信受乐听者说不为触扰
008c22	无益者说尔时梵王知佛受请欢喜踊跃
008c23	遶佛三匝头面礼足忽然不现其去未久
008c24	是时如来静默自思我今先当为谁说法即
008c25	自念言当入槃头城内先为王子提舍大
008c26	臣子骞茶开甘露法门於是世尊如力士
008c27	屈伸臂顷於道树忽然不现至槃头城
008c28	槃头王鹿野苑中敷座而坐佛於是颂曰
008c29	如师子在林自恣而遊行
009a01	彼佛亦如是遊行无罣碍
009a02	毘婆尸佛告守苑人曰汝可入城语王子
009a03	提舍大臣子骞茶宁欲知不毘婆尸佛今
009a04	在鹿野苑中欲见卿等宜知是时时彼
009a05	守苑人受教而行至彼二人所具宣佛教
009a06	二人闻已即至佛所头面礼足却坐一面佛
009a07	渐为说法示教利喜施论戒论生天之论欲
009a08	恶不淨上漏为患讚歎出离为最微妙清
009a09	淨第一尔时世尊见此二人心意柔輭欢喜
009a10	信乐堪受正法於是即为说苦圣谛敷演
009a11	开解分布宣释苦集圣谛苦灭圣谛苦出要
009a12	谛尔时王子提舍大臣子骞茶即於座上
009a13	远离尘垢得法眼淨犹若素质易为受
009a14	染是时地神即唱斯言毗婆尸如来於槃头
009a15	城鹿野苑中转无上法轮沙门婆罗门诸天
009a16	魔梵及余世人所不能转如是展转声彻
009a17	四天王乃至他化自在天须臾之顷声至梵
009a18	天佛时颂曰
009a19	欢喜心踊跃称讚於如来
009a20	毘婆尸成佛转无上法轮
009a21	初从树王起往诣槃头城
009a22	为骞茶提舍转四谛法轮
009a23	时骞茶提舍受佛教化已
009a24	於淨法轮中梵行无有上
009a25	彼忉利天众及以天帝释
009a26	欢喜转相告诸天无不闻
009a27	佛出於世间转无上法轮
009a28	增益诸天众减损阿须伦
009a29	昇仙名普闻善智离世边
009b01	於诸法自在智慧转法轮
009b02	观察平等法息心无垢秽
009b03	以离生死扼智慧转法轮
009b04	灭苦离诸恶出欲得自在
009b05	离於恩爱狱智慧转法轮
009b06	正觉人中尊二足尊调御
009b07	一切缚得解智慧转法轮
009b08	教化善导师能降伏魔怨
009b09	彼离於诸恶智慧转法轮
009b10	无漏力降魔诸根定不懈
009b11	尽漏离魔缚智慧转法轮
009b12	若学决定法知诸法无我
009b13	此为法中上智慧转法轮
009b14	不以利养故亦不求名誉
009b15	愍彼众生故智慧转法轮
009b16	见众生苦厄老病死逼迫
009b17	为此三恶趣智慧转法轮
009b18	断贪瞋恚癡拔爱之根原
009b19	不动而解脱智慧转法轮
009b20	难胜我已胜胜已自降伏
009b21	已胜难胜魔智慧转法轮
009b22	此无上法轮唯佛乃能转
009b23	诸天魔释梵无有能转者
009b24	亲近转法轮饶益天人众
009b25	此等天人师得度于彼岸
009b26	是时王子提舍大臣子骞茶见法得果真
009b27	实无欺成就无畏即白毘婆尸佛言我等
009b28	欲於如来法中淨修梵行佛言善来比丘
009b29	吾法清淨自在修行以尽苦际尔时二人即
009c01	得具戒具戒未久如来又以三事示现一
009c02	曰神足二曰观他心三曰教诫即得无漏
009c03	心解脱生无疑智尔时槃头城内众多
009c04	人民闻二人出家学道法服持鉢淨修梵行
009c05	皆相谓曰其道必真乃使此等舍世荣位
009c06	捐弃所重时城内八万四千人往诣鹿野苑
009c07	中毘婆尸佛所头面礼足却坐一面佛渐为
009c08	说法示教利喜施论戒论生天之论欲恶不
009c09	淨上漏为患讚歎出离为最微妙清淨第
009c10	一尔时世尊见此大众心意柔輭欢喜信乐
009c11	堪受正法於是即为说苦圣谛敷演开解
009c12	分布宣释苦集圣谛苦灭圣谛苦出要谛
009c13	时八万四千人即於座上远尘离垢得法
009c14	眼淨犹如素质易为受色见法得果真
009c15	实无欺成就无畏即白佛言我等欲於如
009c16	来法中淨修梵行佛言善来比丘吾法清
009c17	淨自在修行以尽苦际时八万四千人即得
009c18	具戒具戒未久世尊以三事教化一曰神
009c19	足二曰观他心三曰教诫即得无漏心解脱
009c20	生无疑智前八万四千人闻佛於鹿
009c21	野苑中转无上法轮沙门婆罗门诸天魔梵
009c22	及余世人所不能转即诣槃头城毘婆尸
009c23	佛所头面礼足却坐一面佛时颂曰
009c24	如人救头燃速疾求灭处
009c25	彼人亦如是速诣於如来
009c26	时佛为说法亦复如是尔时槃头城有十
009c27	六万八千大比丘众提舍比丘骞茶比丘於
009c28	大众中上昇虚空身出水火现诸神变而
009c29	为大众说微妙法尔时如来默自念言今
0010a01	此城内乃有十六万八千大比丘众宜遣遊
0010a02	行各二人俱在在处处至於六年还来城
0010a03	内说具足戒时首陀会天知如来心譬如
0010a04	力士屈伸臂顷从彼天没忽然至此於世
0010a05	尊前头面礼足却住一面须臾白佛言如
0010a06	是世尊此槃头城内比丘众多宜各分布处
0010a07	处遊行至於六年乃还此城说具足戒
0010a08	我当拥护令无伺求得其便者尔时如来
0010a09	闻此天语默然可之时首陀会天见佛默
0010a10	然许可即礼佛足忽然不现还至天上其
0010a11	去未久佛告诸比丘今此城内比丘众多
0010a12	宜各分布遊行教化至六年已还集说戒
0010a13	时诸比丘受佛教已执持衣鉢礼佛而去
0010a14	佛时颂曰
0010a15	佛悉无乱众无欲无恋着
0010a16	威如金翅鸟如鹤舍空池
0010a17	时首陀会天於一年後告诸比丘汝等遊
0010a18	行已过一年余有五年汝等当知讫六年
0010a19	已还城说戒如是至于六年天复告言六
0010a20	年已满当还说戒时诸比丘闻天语已摄
0010a21	持衣鉢还槃头城至鹿野苑毘婆尸佛所
0010a22	头面礼足却坐一面佛时颂曰
0010a23	如象善调随意所之
0010a24	大众如是随教而还
0010a25	尔时如来於大众前上昇虚空结加趺
0010a26	坐讲说戒经忍辱为第一佛说涅槃最不
0010a27	以除须发害他为沙门时首陀会天去佛
0010a28	不远以偈颂曰
0010a29	如来大智微妙独尊
0010b01	止观具足成最正觉
0010b02	愍群生故在世成道
0010b03	以四真谛为声闻说
0010b04	苦与苦因灭苦之谛
0010b05	贤圣八道到安隐处
0010b06	毘婆尸佛出现于世
0010b07	在大众中如日光曜
0010b08	说此偈已忽然不现尔时世尊告诸比丘
0010b09	我自思念昔一时於罗阅城耆阇崛山时生
0010b10	是念我所生处无所不遍唯除首陀会
0010b11	天设生彼天则不还此我时比丘复生是
0010b12	念我欲至无造天上时我如壮士屈伸
0010b13	臂顷於此间没现於彼天时彼诸天见我
0010b14	至彼头面作礼於一面立而白我言我等
0010b15	皆是毘婆尸如来弟子从彼佛化故来生
0010b16	此具说彼佛因缘本末又尸弃佛毘沙婆
0010b17	佛拘楼孙佛拘那含佛迦叶佛释迦牟尼佛
0010b18	皆是我师我从受化故来生此亦说诸佛
0010b19	因缘本末至生阿迦尼咤诸天亦复如是
0010b20	佛时颂曰
0010b21	譬如力士屈伸臂顷
0010b22	我以神足至无造天
0010b23	第七大仙降伏二魔
0010b24	无热无见叉手敬礼
0010b25	如昼度树释师远闻
0010b26	相好具足到善见天
0010b27	犹如莲华水所不着
0010b28	世尊无染至大善见
0010b29	如日初出淨无尘翳
0010c01	明若秋月诣一究竟
0010c02	此五居处众生所淨
0010c03	心淨故来诣无烦恼
0010c04	淨心而来为佛弟子
0010c05	舍离染取乐於无取
0010c06	见法决定毘婆尸子
0010c07	淨心善来诣大仙人
0010c08	尸弃佛子无垢无为
0010c09	以淨心来诣离有尊
0010c10	毘沙婆子诸根具足
0010c11	淨心诣我如日照空
0010c12	拘楼孙子舍离诸欲
0010c13	淨心诣我妙光焰盛
0010c14	拘那含子无垢无为
0010c15	淨心诣我光如月满
0010c16	迦叶弟子诸根具足
0010c17	淨心诣我如比天念不乱大仙
0010c18	神足第一以坚固心
0010c19	为佛弟子　淨心而来
0010c20	为佛弟子礼敬如来
0010c21	具启人尊　所生成道
0010c22	名姓种族知见深法
0010c23	成无上道　比丘静处
0010c24	离于尘垢精勤不懈
0010c25	断诸有结　此是诸佛
0010c26	本末因缘释迦如来
0010c27	之所演说
0010c28	佛说此大因缘经已诸比丘闻佛所说欢
0010c29	喜奉行
0011a01	佛说长阿含经卷第一`
export const jinshan_da_1=`冊欄行	徑山藏第38冊 545 經 JS038n0545
345a01	佛说长阿含经卷第一
345a02	姚秦三藏法师佛陀耶舍共竺佛念译
345a03	第一分初大本缘经第一
345a04	如是我闻一时佛在舍卫国祇树华林窟与大比丘
345a05	众千二百五十人俱时诸比丘於乞食后集华林堂
345a06	各共议言诸贤比丘唯无上尊为最奇特神通远达
345a07	威力弘大乃知过去无数诸佛入於涅槃断诸结使
345a08	销灭戏论又知彼佛劫数多少名号姓字所生种族
345a09	其所饮食寿命脩短所更苦乐又知彼佛有如是戒
345a10	有如是法有如是慧有如是解有如是住云何诸贤
345a11	如来为善别法性知如是事为诸天来语乃知此事
345a12	尔时世尊在闲静处天耳清净闻诸比丘作如是议
345a13	即从座起诣华林堂就座而坐尔时世尊知而故问
345a14	谓诸比丘汝等集此何所语议时诸比丘具以事答
345a15	尔时世尊告诸比丘善哉善哉汝等以平等信出家
345a16	修道诸所应行凡有二业一曰贤圣讲法二曰贤圣
345a17	默然汝等所论正应如是如来神通威力弘大尽知
345a18	过去无数劫事以能善解法性故知亦以诸天来语
345a19	故知佛时颂曰
345a20	比丘集法堂讲说贤圣论如来处静室
345b01	天耳尽闻知佛日光普照分别法界义
345b02	亦知过去事三佛般泥洹名号姓种族
345b03	受生分亦知随彼之处所净眼皆记之
345b04	诸天大威力容貌甚端严亦来启告我
345b05	三佛般涅槃记生名号姓哀鸾音尽知
345b06	无上天人尊记於过去佛
345b07	又告诸比丘汝等欲闻如来识宿命智知於过去诸
345b08	佛因缘不我当说之时诸比丘白佛言世尊今正是
345b09	时愿乐欲闻善哉世尊以时讲说当奉行之佛告诸
345b10	比丘谛听谛听善思念之吾当为汝分别解说时诸
345b11	比丘受教而听佛告诸比丘过去九十一劫时世有
345b12	佛名毗婆尸如来至真出现于世复次比丘过去三
345b13	十一劫有佛名尸弃如来至真出现於世复次比丘
345b14	即彼三十一劫中有佛名毗舍婆如来至真出现於
345b15	世复次比丘此贤劫中有佛名拘留孙又名拘那含
345b16	又名迦叶我今亦於贤劫中成最正觉佛时颂曰
345b17	过九十一劫有毗婆尸佛次三十一劫
345b18	有佛名尸弃即於彼劫中毗舍如来出
345b19	今此贤劫中无数那维岁有四大仙人
345b20	愍众生故出拘留孙那含迦叶释迦文
346a01	汝等当知毗婆尸佛时人寿八万岁尸弃佛时人寿
346a02	七万岁毗舍婆佛时人寿六万岁拘留孙佛时人寿
346a03	四万岁拘那含佛时人寿三万岁迦叶佛时人寿二
346a04	万岁我今出世人寿百岁少出多减佛时颂曰
346a05	毗婆尸时人寿八万四千尸弃佛时人
346a06	寿命七万岁毗舍婆时人寿命六万岁
346a07	拘留孙时人寿命四万岁拘那含时人
346a08	寿命三万岁迦叶佛时人寿命二万岁
346a09	如我今时人寿命不过百
346a10	毗婆尸佛出刹利种姓憍陈若尸弃佛毗舍婆佛种
346a11	姓亦尔拘留孙佛出婆罗门种姓迦叶拘那含佛迦
346a12	叶佛种姓亦尔我今如来至真出刹利种姓名曰瞿
346a13	昙佛时颂曰
346a14	毗婆尸如来尸弃毗舍婆此三等正觉
346a15	出憍陈若姓自餘三如来出于迦叶姓
346a16	我今无上尊导御诸众生天人中第一
346a17	勇猛姓瞿昙前三等正觉出於刹利种
346a18	其后三如来出婆罗门种我今无上尊
346a19	勇猛出刹利
346a20	毗婆尸佛坐婆罗树下成最正觉尸弃佛坐分陀利
346b01	树下成最正觉毗舍婆佛坐博洛叉树下成最正觉
346b02	拘留孙佛坐尸利沙树下成最正觉拘那含佛坐优
346b03	昙婆罗树下成最正觉迦叶佛坐尼拘类树下成最
346b04	正觉我今如来至真坐钵多树下成最正觉佛时颂
346b05	曰
346b06	毗婆尸如来往诣婆罗树即於彼处所
346b07	得成最正觉尸弃分陀树成道灭有原
346b08	毗舍婆如来坐博叉树下获解脱知见
346b09	神足无所碍拘留孙如来坐尸利树下
346b10	一切智清净无染无所著拘那含牟尼
346b11	坐乌暂树下即於彼处所灭诸贪忧恼
346b12	迦叶如来坐尼拘类树下即於彼处所
346b13	除灭诸有本我今释迦文坐於钵多树
346b14	如来十力尊断灭诸缘使摧伏众魔怨
346b15	在众演大明七佛精进力放光灭暗冥
346b16	各各坐诸树於中成正觉
346b17	毗婆尸如来三会说法初会弟子有十六万八千人
346b18	二会弟子有十万人三会弟子有八万人尸弃如来
346b19	亦三会说法初会弟子有十万人二会弟子有八万
346b20	人三会弟子有七万人毗舍婆如来二会说法初会
347a01	弟子有七万人次会弟子有六万人拘留孙如来一
347a02	会说法弟子四万人拘那含如来一会说法弟子三
347a03	万人迦叶如来一会说法弟子二万人我今一会说
347a04	法弟子千二百五十人佛时颂曰
347a05	毗婆尸名观智慧不可量遍见无所畏
347a06	三会弟子众尸弃光无动能灭诸结使
347a07	无量大威德无能测量者彼佛亦三会
347a08	弟子普共集毗舍婆断结大仙人要集
347a09	名闻於诸方妙法大名称二会弟子众
347a10	普演深奥义拘留孙一会哀愍疗诸苦
347a11	导师化众生一会弟子众拘那含如来
347a12	无上亦如是紫磨金色身容貌悉具足
347a13	一会弟子众普演微妙法迦叶一一毛
347a14	一心无乱想二语不烦重一会弟子众
347a15	能仁意寂灭释种沙门上天中天最尊
347a16	我一会弟子彼会我现义演布清净教
347a17	心常怀欢喜漏尽复尽有毗婆尸弃三
347a18	毗舍婆佛二四佛各各一仙人会演说
347a19	时毗婆尸佛有二弟子一名骞荼二名踬沙诸弟子
347a20	中最为第一尸弃佛有二弟子一名阿毗浮二名三
347b01	婆婆诸弟子中最为第一毗舍婆佛有二弟子一名
347b02	扶游二名郁多摩诸弟子中最为第一拘留孙佛有
347b03	二弟子一名萨尼二名毗楼诸弟子中最为第一拘
347b04	那含佛有二弟子一名优波鲜多二名郁多罗诸弟
347b05	子中最为第一迦叶佛有二弟子一名提舍二名婆
347b06	罗婆诸弟子中最为第一今我二弟子一名舍利弗
347b07	二名目揵连诸弟子中最为第一佛时颂曰
347b08	骞荼踬沙等毗婆尸弟子阿毗浮三婆
347b09	尸弃佛弟子扶游郁多摩弟子中第一
347b10	二俱降魔怨毗舍婆弟子萨尼毗楼等
347b11	拘留孙弟子优波郁多罗拘那含弟子
347b12	提舍婆罗婆迦叶佛弟子舍利弗目连
347b13	是我第一子
347b14	毗婆尸佛有执事弟子名曰无忧尸弃佛执事弟子
347b15	名曰忍行毗舍婆佛有执事弟子名曰寂灭拘留孙
347b16	佛有执事弟子名曰善觉拘那含佛有执事弟子名
347b17	曰安和迦叶佛有执事弟子名曰善友我执事弟子
347b18	名曰阿难佛时颂曰
347b19	无忧与忍行寂灭及善觉安和善友等
347b20	阿难为第七此为佛侍者具足诸义趣
348a01	昼夜无放逸自利亦利他此七贤弟子
348a02	侍七佛左右欢喜而供养寂灭归灭度
348a03	毗婆尸佛有子名曰方膺尸弃佛有子名曰无量毗
348a04	舍婆佛有子名曰妙觉拘留孙佛有子名曰上胜拘
348a05	那含佛有子名曰导师迦叶佛有子名曰进军今我
348a06	有子名曰罗睺罗佛时颂曰
348a07	方膺无量子妙觉及上胜导师进军等
348a08	罗睺罗第七此诸豪贵子绍继诸佛种
348a09	爱法好施惠於圣法无畏
348a10	毗婆尸佛父名槃头摩多刹利王种母名槃头摩底
348a11	王所治城名槃头摩那佛时颂曰
348a12	遍眼父槃头母槃头摩底槃头摩那城
348a13	佛於中说法
348a14	尸弃佛父名明相刹利王种母名光曜王所治城名
348a15	光相佛时颂曰
348a16	尸弃父明相母名曰光曜於光相城中
348a17	威德降外敌
348a18	毗舍婆佛父名善灯刹利王种母名称戒王所治城
348a19	名曰无喻佛时颂曰
348a20	毗舍婆佛父善灯刹利种母名曰称戒
348b01	城名曰无喻
348b02	拘留孙佛父名礼德婆罗门种母名善枝王名安和
348b03	随王名故城名安和佛时颂曰
348b04	礼德婆罗门母名曰善枝王名曰安和
348b05	居在安和城
348b06	拘那含佛父名大德婆罗门种母名善胜是时王名
348b07	清净随王名故城名清净佛时颂曰
348b08	大德婆罗门母名曰善胜王名曰清净
348b09	居在清净城
348b10	迦叶佛父名曰梵德婆罗门种母名曰财主是时王
348b11	名波罗毗王所治城名波罗柰佛时颂曰
348b12	梵德婆罗门母名曰财主时王名波毗
348b13	在波罗柰城
348b14	我父名净饭刹利王种母名大化王所治城名迦毗
348b15	罗卫佛时颂曰
348b16	父刹利净饭母名曰大化土广民丰饶
348b17	我从彼而生
348b18	此是诸佛因缘名号种族所出生处何有智者闻此
348b19	因缘而不欢喜起爱乐心尔时世尊告诸比丘吾今
348b20	欲以宿命智说过去佛事汝欲闻不诸比丘对曰今
349a01	正是时愿乐欲闻佛告诸比丘谛听谛听善思念之
349a02	吾当为汝分别解说比丘当知诸佛常法毗婆尸菩
349a03	萨从兜率天降神母胎从右胁入正念不乱当於尔
349a04	时地为震动放大光明普照世界日月所不及处皆
349a05	蒙大明幽冥众生各相睹见知其所趣时此光明复
349a06	照魔宫诸天释梵沙门婆罗门及餘众生普蒙大明
349a07	诸天光明自然不现佛时颂曰
349a08	密云悬虚空电光照天下毗婆尸降胎
349a09	光明照亦然日月所不及莫不蒙大明
349a10	处胎净无秽诸佛法皆然
349a11	诸比丘当知诸佛常法毗婆尸菩萨在母胎时专念
349a12	不乱有四天子手执戈鉾侍护其母人与非人不得
349a13	侵扰此是常法佛时颂曰
349a14	四方四天子有名称威德天帝释所遣
349a15	善守护菩萨手常执戈鉾侍卫不去离
349a16	人非人不扰此诸佛常法天神所拥护
349a17	如天女卫天眷属怀欢喜此诸佛常法
349a18	又告比丘诸佛常法毗婆尸菩萨从兜率天降神母
349a19	胎专念不乱母身安隐无众恼患智慧增益母自观
349a20	胎见菩萨身诸根具足如紫磨金无有瑕秽犹如有
349b01	目之士观净琉璃内外清彻无众障翳诸比丘此是
349b02	诸佛常法尔时世尊而说偈言
349b03	如净琉璃珠其明如日月仁尊处母胎
349b04	其母无恼患智慧为增益观胎如金像
349b05	母怀妊安乐此诸佛常法
349b06	佛告诸比丘毗婆尸菩萨从兜率天降神母胎专念
349b07	不乱母心清净无众欲想不为淫火之所烧然此是
349b08	诸佛常法尔时世尊而说偈言
349b09	菩萨住母胎天中天福成其母心清净
349b10	无有众欲想舍离诸淫欲不染不亲近
349b11	不为欲火然诸佛母常净
349b12	佛告比丘诸佛常法毗婆尸菩萨从兜率天降神母
349b13	胎专念不乱其母奉持五戒梵行清净笃信仁爱诸
349b14	善成就安乐无畏身坏命终生忉利天此是常法尔
349b15	时世尊而说偈言
349b16	持人中尊身精进戒具足后必受天身
349b17	此缘名佛母
349b18	佛告比丘诸佛常法毗婆尸菩萨当其生时从右胁
349b19	出地为震动光明普照始入胎时暗冥之处无不蒙
349b20	明此是常法尔时世尊而说偈言
350a01	太子生地动大光靡不照此界及餘界
350a02	上下与诸方放光施净因具足於天身
350a03	以欢喜净音转称菩萨名
350a04	佛告比丘诸佛常法毗婆尸菩萨当其生时从右胁
350a05	出专念不乱时菩萨母手攀树枝不坐不卧时四天
350a06	子手捧香水於母前立言唯然天母今生圣子勿怀
350a07	忧戚此是常法尔时世尊而说偈言
350a08	佛母不坐卧住戒修梵行生尊不懈怠
350a09	天人所奉侍
350a10	佛告比丘诸佛常法毗婆尸菩萨当其生时从右胁
350a11	出专念不乱其身清净不为秽恶之所染污犹如有
350a12	目之士以净明珠投白缯上两不相污二俱净故菩
350a13	萨出胎亦复如是此是常法尔时世尊而说偈言
350a14	犹如净明珠投缯不染污菩萨出胎时
350a15	清净无染污
350a16	佛告比丘诸佛常法毗婆尸菩萨当其生时从右胁
350a17	出专念不乱从右胁出堕地行七步无人扶持遍观
350a18	四方举手而言天上天下唯我为尊要度众生生老
350a19	病死此是常法尔时世尊而说偈言
350a20	犹如师子步遍观於四方堕地行七步
350b01	人师子亦然又如大龙行遍观於四方
350b02	堕地行七步人龙亦复然两足尊生时
350b03	安行於七步观四方举声当尽生死苦
350b04	当其初生时无尊尊与尊自观生死本
350b05	此身最后边
350b06	佛告比丘诸佛常法毗婆尸菩萨当其生时从右胁
350b07	出专念不乱二泉涌出一温一泠以供澡浴此是常
350b08	法尔时世尊而说偈言
350b09	两足尊生时二泉自涌出以供菩萨用
350b10	遍眼浴清净二泉自涌出其水甚清净
350b11	一温一清泠以浴一切智
350b12	太子初生父王槃头召集相师及诸道术令观太子
350b13	知其吉凶时诸相师受命而观即前披衣见有具相
350b14	占曰有此相者当趣二处必然无疑若在家者当为
350b15	转轮圣王王四天下四兵具足以正法治无有偏枉
350b16	恩及天下七宝自至千子勇健能伏外敌兵仗不用
350b17	天下太平若出家学道当成正觉十号具足时诸相
350b18	师即白王言王所生子有三十二相当趣二处必然
350b19	无疑在家当为转轮圣王若出家必成正觉十号具
350b20	足佛时颂曰
351a01	百福太子生相师之所说如典记所载
351a02	趣二处无疑若其乐家者当为转轮王
351a03	七宝难可获为王宝自至真金千辐具
351a04	周匝金辋持轮能飞遍行故名为天轮
351a05	善调七支住高广白如雪能善飞虚空
351a06	名第二象宝马行周天下朝去暮还食
351a07	珠毛孔雀胭名为第三宝清净琉璃珠
351a08	光照一由旬照夜明如昼名为第四宝
351a09	色声香味触无有与等者诸女中第一
351a10	名为第五宝献王琉璃宝珠玉及众珍
351a11	欢喜而贡奉名为第六宝如转轮王念
351a12	军众速来去捷疾如王意名为第七宝
351a13	此名为七宝轮象马纯白琉璃珠女宝
351a14	典兵宝为七观此无有猒五欲自娱乐
351a15	如象断羁绊出家成正觉王有如是子
351a16	二足人中尊处世转法轮道成无懈怠
351a17	是时父王殷勤再三重问相师汝等更观太子三十
351a18	二相斯名何等时诸相师即披太子衣说三十二相
351a19	一者足安平足下平满蹈地安隐二者足下相轮千
351a20	辐成就光光相照三者手足网缦犹如鹅王四者手
351b01	足柔软犹如天衣五者手足指纤长无能及者六者
351b02	足跟充满观视无猒七者鹿腨肠上下佣直八者钩
351b03	锁骨骨节相钩犹如连锁九者阴马藏十者平立垂
351b04	手过膝十一一一毛孔一一毛生其毛右旋绀琉璃
351b05	色十二毛生右旋绀色仰靡十三身黄金色十四皮
351b06	肤细软不受尘秽十五两肩齐停充满圆好十六胸
351b07	有卐字十七身长倍人十八七处平满十九身长广
351b08	等如尼拘类树二十颊车如师子二十一胸膺方整
351b09	如师子二十二口四十齿二十三方整齐平二十四
351b10	齿密无间二十五齿白鲜明二十六咽喉清净所食
351b11	众味无不称适二十七广长舌左右舐耳二十八梵
351b12	音清彻二十九眼绀青色三十眼如牛王眼上下俱
351b13	眴三十一眉间白毫柔软细泽引长一寻放则右旋
351b14	螺如真珠三十二顶有肉髻是为三十二相即说颂
351b15	曰
351b16	善住柔软足不蹈地迹现千辐相庄严
351b17	光色靡不具如尼拘类树纵广正平等
351b18	如来未曾有袐密阴马藏金宝庄严身
351b19	众相互相映虽顺俗流汗尘土亦不污
351b20	天色极柔软天盖自然覆梵音身紫金
352a01	如华始出池王以问相师相师敬报王
352a02	称赞菩萨相举身光明具手足诸支节
352a03	中外靡不现食味尽具足身正不倾邪
352a04	足下轮相现其音如哀鸾佣髀形相具
352a05	宿业之所成臂肘圆满好眉目甚端严
352a06	人中师子尊威力最第一其颊车方整
352a07	卧胁如师子齿方整四十齐密中无间
352a08	梵音未曾有远近随缘到平立不倾身
352a09	二手摩扪膝手齐整柔软人尊美相具
352a10	一孔一毛生手足网缦相肉髻目绀青
352a11	眼上下俱眴两肩圆充满三十二相具
352a12	足跟无高下鹿腨肠纤佣天中天来此
352a13	如象绝羁绊解脱众生苦处生老病死
352a14	以慈悲心故为说四真谛开演法句义
352a15	令众奉至尊
352a16	佛告比丘毗婆尸菩萨生时诸天在於上虚空中手
352a17	执白盖宝扇以障寒暑风雨尘土佛时颂曰
352a18	人中未曾有生於二足尊诸天怀敬养
352a19	奉宝盖宝扇
352a20	尔时父王给四乳母一者乳哺二者澡浴三者涂香
352b01	四者娱乐欢喜养育无有懈怠於是颂曰
352b02	乳母有慈爱子生即育养一乳哺一浴
352b03	二涂香娱乐世间最妙香以涂人中尊
352b04	为童子时举国士女视无猒足於是颂曰
352b05	多人所敬爱如金像始成男女共谛观
352b06	视之无猒足
352b07	为童子时举国士女众共怀抱如观宝华於是颂曰
352b08	二足尊生世多人所爱敬展转共传抱
352b09	如观宝华香
352b10	菩萨生时其目不眴如忉利天以不眴故得名毗婆
352b11	尸於是颂曰
352b12	天中天不眴犹如忉利天见色而正观
352b13	故号毗婆尸
352b14	菩萨生时其声清彻柔软和雅如迦陵频伽鸟声於
352b15	是颂曰
352b16	犹如雪山鸟饮华汁而鸣其彼二足尊
352b17	声清彻亦然
352b18	菩萨生时眼能彻视见一由旬於是颂曰
352b19	清净业行报受天妙光明菩萨目所见
352b20	周遍一由旬
353a01	菩萨生时年渐长大在大正堂以道开化恩及庶民
353a02	名德远闻於是颂曰
353a03	童幼处正堂以道化天下决断众事务
353a04	故号毗婆尸清净智广博甚深犹大海
353a05	悦可於群生使智慧增广
353a06	於时菩萨欲出游观告敕御者严驾宝车诣彼园林
353a07	巡行游观御者即便严驾讫巳还白今正是时太子
353a08	即乘宝车诣彼园观於其中路见一老人头白齿落
353a09	面皱身偻拄杖羸步喘息而行太子顾问侍者此为
353a10	何人答曰此是老人又问何如为老答曰夫老者生
353a11	寿向尽餘命无几故谓之老太子又问吾亦当尔不
353a12	免此患也答曰然生必有老无有豪贱於是太子怅
353a13	然不悦即告侍者回驾还宫静默思惟念此老苦吾
353a14	亦当然佛於是颂曰
353a15	见老命将尽拄杖而羸步菩萨自思惟
353a16	吾未免此难
353a17	尔时父王问彼侍者太子出游欢乐不耶答曰不乐
353a18	又问其故答曰道逢老人是以不乐尔时父王默自
353a19	思念昔日相师占相太子言当出家今者不悦得无
353a20	尔乎当设方便使处深宫五欲娱乐以悦其心令不
353b01	出家即更严饰宫馆拣择婇女以娱乐之佛於是颂
353b02	曰
353b03	父王闻此言方便严宫馆增益以五欲
353b04	欲使不出家
353b05	又於后时太子复命御者严驾出游於其中路逢一
353b06	病人身羸腹大面目黧黑独卧粪秽无人瞻视病甚
353b07	苦毒口不能言顾问御者此为何人答曰此是病人
353b08	曰何如为病答曰病者众痛迫切存亡无期故曰病
353b09	也又曰吾亦当尔不免此患耶答曰然生则有病无
353b10	有贵贱於是太子怅然不悦即告御者回车还宫静
353b11	默思惟念此病苦吾亦当然佛於是颂曰
353b12	见彼久病人颜色为衰损静默自思惟
353b13	吾未免此患
353b14	尔时父王复问御者太子出游欢乐不耶答曰不乐
353b15	又问其故答曰道逢病人是以不乐於是父王默自
353b16	思念昔日相师占相太子言当出家今日不悦得无
353b17	尔乎吾当更设方便增诸妓乐以悦其心使不出家
353b18	即复严饰宫馆㨂择婇女以娱乐之佛於是颂曰
353b19	色声香味触微妙可悦乐菩萨福所致
353b20	故娱乐其中
354a01	又於异时太子复敕御者严驾出游於其中路逢一
354a02	死人杂色缯旛前后导引宗族亲里悲号哭泣送之
354a03	出城太子复问此为何人答曰此是死人问曰何如
354a04	为死答曰死者尽也风先火次诸根坏败存亡异趣
354a05	室家离别故谓之死太子又问御者吾亦当尔不免
354a06	此患耶答曰然生必有死无有贵贱於是太子怅然
354a07	不悦即告御者回车还宫静默思惟念此死苦吾亦
354a08	当然佛时颂曰
354a09	始见人有死知其复更生静默自思惟
354a10	吾未免此患
354a11	尔时父王复问御者太子出游欢乐不也答曰不乐
354a12	又问其故答曰道逢死人是故不乐於是父王默自
354a13	思念昔日相师占相太子言当出家今日不悦得无
354a14	尔乎吾当更设方便增诸妓乐以悦其心使不出家
354a15	即复严饰宫馆㨂择婇女以娱乐之佛於是颂曰
354a16	童子有名称婇女众围绕五乐以自娱
354a17	如彼天帝释
354a18	又於异时复敕御者严驾出游於其中路逢一沙门
354a19	法服持钵视地而行即问御者此为何人御者答曰
354a20	此是沙门又问何谓沙门答曰沙门者舍离恩爱出
354b01	家修道摄御诸根不染外欲慈心一切无所伤害逢
354b02	苦不戚遇乐不欣能忍如地故号沙门太子曰善哉
354b03	此道真正永绝尘累微妙清虚唯是为快即敕御者
354b04	回车就之尔时太子问沙门曰剃除须发法服持钵
354b05	何所志求沙门答曰夫出家者欲调伏心意永离尘
354b06	垢慈育群生无所侵扰虚心静寞唯道是务太子曰
354b07	善哉此道最真寻敕御者赍吾宝衣并及乘轝还白
354b08	大王我即於此剃除须发服三法衣出家修道所以
354b09	然者欲调伏心意舍离尘垢清净自居以求道术於
354b10	是御者即以太子所乘宝车及与衣服还归父王太
354b11	子於后即剃须发服三法衣出家修道佛告比丘太
354b12	子见老病人知世苦恼又见死人恋世情灭及见沙
354b13	门廓然大悟下宝车时步步中间转远缚著是真出
354b14	家是真远离时彼国人闻太子剃除须发法服持钵
354b15	出家修道咸相谓言此道必真乃令太子舍国荣位
354b16	捐弃所重于时国中八万四千人往就太子求为弟
354b17	子出家修道佛时颂曰
354b18	选择深妙法彼闻随出家离於恩爱狱
354b19	无有众结缚
354b20	于时太子即便纳受与之游行在在教化从村至村
355a01	从国至国所到之处无不恭敬四事供养菩萨念言
355a02	吾与大众游行诸国人间愦闹此非我宜何时当得
355a03	离此群众闲静之处以求其道寻获志愿於闲静处
355a04	专精修道复作是念众生可愍常处暗冥受身危脆
355a05	有生有老有病有死众苦所集死此生彼从彼生此
355a06	缘此苦阴流转无穷我当何时晓了苦阴灭生老死
355a07	复作是念生死何从何缘而有即以智慧观察所由
355a08	从生有老死生是老死缘生从有起有是生缘有从
355a09	取起取是有缘取从爱起爱是取缘爱从受起受是
355a10	爱缘受从触起触是受缘触从六入起六入是触缘
355a11	六入从名色起名色是六入缘名色从识起识是名
355a12	色缘识从行起行是识缘行从痴起痴是行缘是为
355a13	缘痴有行缘行有识缘识有名色缘名色有六入缘
355a14	六入有触缘触有受缘受有爱缘爱有取缘取有有
355a15	缘有有生缘生有老病死忧悲苦恼此苦盛阴缘生
355a16	而有是为苦集菩萨思惟苦集阴时生智生眼生觉
355a17	生明生通生慧生证於时菩萨复自思惟何等无故
355a18	老死无何等灭故老死灭即以智慧观察所由生无
355a19	故老死无生灭故老死灭有无故生无有灭故生灭
355a20	取无故有无取灭故有灭爱无故取无爱灭故取灭
355b01	受无故爱无受灭故爱灭触无故受无触灭故受灭
355b02	六入无故触无六入灭故触灭名色无故六入无名
355b03	色灭故六入灭识无故名色无识灭故名色灭行无
355b04	故识无行灭故识灭痴无故行无痴灭故行灭是为
355b05	痴灭故行灭行灭故识灭识灭故名色灭名色灭故
355b06	六入灭六入灭故触灭触灭故受灭受灭故爱灭爱
355b07	灭故取灭取灭故有灭有灭故生灭生灭故老死忧
355b08	悲苦恼灭菩萨思惟苦阴灭时生智生眼生觉生明
355b09	生通生慧生证尔时菩萨逆顺观十二因缘如实知
355b10	如实见巳即於座上成阿耨多罗三藐三菩提佛时
355b11	颂曰
355b12	此言众中说汝等当善听过去菩萨观
355b13	本所未闻法老死从何缘因何等而有
355b14	如是正观巳知其本由生生本由何缘
355b15	因何事而有如是思惟巳知生从有起
355b16	取彼取彼已展转更增有是故如来说
355b17	取是有因缘以深秽恶聚风吹无流演
355b18	如是取相因因爱而广普爱由於受生
355b19	起苦罗网本以染著因缘苦乐共相应
355b20	受本由何缘因何而有受如是思惟巳
356a01	知受由触生触本由何缘因何而有触
356a02	如是思惟巳触由六入生六入本何缘
356a03	因何有六入如是思惟巳六入名色生
356a04	名色本何缘因何有名色如是思惟巳
356a05	名色从识生识本由何缘因何而有识
356a06	如是思惟巳知识从行生行本由何缘
356a07	因何而有行如是思惟巳知行从痴生
356a08	如是因缘者名为实义因智慧方便观
356a09	能见因缘根苦非贤圣造亦非无缘有
356a10	是故变易苦智者所断除若无明灭尽
356a11	是时则无行若无有行者则亦无有识
356a12	若识永灭者亦无有名色名色既以灭
356a13	则无有诸入若诸入永灭则亦无有触
356a14	若触永灭者则亦无有受若受永灭者
356a15	则亦无有爱若爱永灭者则亦无有取
356a16	若取永灭者则亦无有有若有永灭者
356a17	则亦无有生若生永灭者无老病苦阴
356a18	一切都永尽智者之所说十二缘甚深
356a19	难见难识知唯佛能善觉因是有是无
356a20	若能自观察则无有诸入深见因缘者
356b01	更不外求师能於阴界入离欲无染著
356b02	堪受一切施净报施者恩若得四辩才
356b03	获於决定证能解众结缚断阴无放逸
356b04	色受想行识犹如朽故车能谛观此法
356b05	则成等正觉如鸟游虚空东西随风逝
356b06	菩萨断众结如风靡轻衣毗婆尸闲静
356b07	观察於诸法老死何缘有从何而得灭
356b08	彼作是观巳生清净智慧知老死由生
356b09	生灭老死灭
356b10	毗婆尸佛初成道时多修二观一曰安隐观二曰出
356b11	离观佛於是颂曰
356b12	如来无等等多修於二观安隐及出离
356b13	仙人度彼岸其心得自在断除众结使
356b14	登山观四方故号毗婆尸大智光除冥
356b15	如以镜自照为世除忧恼尽生老死苦
356b16	毗婆尸佛於闲静处复作是念我今巳得此无上法
356b17	甚深微妙难解难见息灭静喧智者所知非是凡愚
356b18	所能及也斯由众生异忍异见异受异学依彼异见
356b19	各乐所求各务所习是故於此甚深因缘不能解了
356b20	然爱尽涅槃倍复难知我为彼说彼必不解更生触
357a01	扰作是念巳即便默然不复说法时梵天王知毗婆
357a02	尸如来所念即自思惟今此世间便为败坏甚可哀
357a03	愍毗婆尸佛乃得如此深妙之法而不欲说譬如力
357a04	士屈伸臂顷从梵天宫忽然来下立於佛前头面礼
357a05	足却住一面时梵天王右膝著地叉手合掌白佛言
357a06	唯愿世尊以时说法今此众生尘垢徼薄诸根猛利
357a07	有恭敬心易可开化畏怖后世无救之罪能灭恶法
357a08	出生善道佛告梵王如是如是如汝所言但我於闲
357a09	静处默自思念所得正法甚深微妙若为彼说彼必
357a10	不解更生触扰故我默然不欲说法我从无数阿僧
357a11	祇劫勤苦不懈修无上行今始获此难得之法若为
357a12	淫怒痴众生说者必不承用徒自劳疲此法微妙与
357a13	世相反众生染欲愚冥所覆不能信解梵王我观如
357a14	此是以默然不欲说法时梵天王复重劝请殷勤恳
357a15	恻至于再三世尊若不说法今此世间便为坏败甚
357a16	可哀愍唯愿世尊以时敷演勿使众生坠落餘趣尔
357a17	时世尊三闻梵王殷勤劝请即以佛眼观视世界众
357a18	生垢有厚薄根有利钝教有难易易受教者畏后世
357a19	罪所以能灭恶法出生善道譬如优钵罗华钵头摩
357a20	华拘勿头华分陀利华或有始出污泥未至水者或
357b01	有巳出与水平者或有出水未敷开者然皆不为水
357b02	所染著易可开敷世界众生亦复如是尔时世尊告
357b03	梵王曰吾愍汝等今当开演甘露法门是法深妙难
357b04	可解知今为信受乐听者说不为触扰无益者说尔
357b05	时梵王知佛受请欢喜踊跃绕佛三匝头面礼足忽
357b06	然不现其去未久是时如来静默自思我今先当为
357b07	谁说法即自念言当入槃头城内先为王子踬沙大
357b08	臣子骞荼开甘露法门於是世尊如力士屈伸臂顷
357b09	於道树忽然不见至槃头城槃头王鹿野苑中敷座
357b10	而坐佛於是颂曰
357b11	如师子在林自恣而游行彼佛亦如是
357b12	游行无罣碍
357b13	毗婆尸佛告守苑人曰汝可入城语王子踬沙大臣
357b14	子骞荼宁欲知不毗婆尸佛今在鹿野苑中欲见乡
357b15	等宜知是时时彼守苑人受教而行至彼二人所具
357b16	宣佛教二人闻巳即至佛所头面礼足却坐一面佛
357b17	渐为说法示教利喜施论戒论生天之论欲恶不净
357b18	上漏为患赞叹出离为最微妙清净第一尔时世尊
357b19	见此二人心意柔软欢喜信乐堪受正法於是即为
357b20	说苦圣谛敷演开解分布宣释苦集圣谛苦灭圣谛
358a01	苦出要谛尔时王子踬沙大臣子骞荼即於座上远
358a02	尘离垢得法眼净犹若素质易为受染是时地神即
358a03	唱斯言毗婆尸如来於槃头城鹿野苑中转无上法
358a04	轮沙门婆罗门诸天魔梵及餘世人所不能转如是
358a05	展转声彻四天王乃至他化自在天须臾之顷声至
358a06	梵天佛时颂曰
358a07	欢喜心踊跃称赞於如来毗婆尸成佛
358a08	转无上法轮初从树王起往诣槃头城
358a09	为骞荼踬沙转四谛法轮时骞荼踬沙
358a10	受佛教化巳於净法轮中梵行无有上
358a11	次忉利天众及以天帝释欢喜转相告
358a12	诸天无不闻佛出於世间转无上法轮
358a13	增益诸天众减损阿须伦昇仙名普闻
358a14	苦智离世边於诸法自在智慧转法轮
358a15	观察平等法息心无垢秽以离生死厄
358a16	智慧转法轮灭苦离诸恶出欲得自在
358a17	离於恩爱狱智慧转法轮正觉人中尊
358a18	二足尊调御於一切缚解智慧转法轮
358a19	教化善导师能降伏魔怨彼离於诸恶
358a20	智慧转法轮无漏力降魔诸根定不懈
358b01	尽漏离魔缚智慧转法轮若学决定法
358b02	知诸法无我此为法中上智慧转法轮
358b03	不以利养故亦不求名誉愍彼众生故
358b04	智慧转法轮见众生苦厄老病死逼迫
358b05	为此三恶趣智慧转法轮断贪瞋恚痴
358b06	拔爱之根源不动而解脱智慧转法轮
358b07	难胜我以胜胜以自降伏以胜难胜魔
358b08	智慧转法轮此无上法轮唯佛乃能转
358b09	诸天魔释梵无有能转者亲近转法轮
358b10	饶益天人众此等天人师得度于彼岸
358b11	是时王子踬沙大臣子骞荼见法得果真实无欺成
358b12	就无畏即白毗婆尸佛言我等欲於如来法中净修
358b13	梵行佛言善来比丘吾法清净自在修行以尽苦际
358b14	尔时二人即得具戒具戒未久如来又以三事示现
358b15	一曰神足二曰观他心三曰教戒即得无漏心解脱
358b16	生无疑智尔时槃头城内众多人民闻二人出家学
358b17	道法服持钵净修梵行皆相谓曰其道必真乃使此
358b18	等舍世荣位捐弃所重时城内八万四千人往诣鹿
358b19	野苑中毗婆尸佛所头面礼足却坐一面佛渐为说
358b20	法示教利喜施论戒论生天之论欲恶不净上漏为
359a01	患赞叹出离为最微妙清净第一尔时世尊见此大
359a02	众心意柔软欢喜信乐堪受正法於是即为说苦圣
359a03	谛敷演开解分布宣释苦集圣谛苦灭圣谛苦出要
359a04	圣谛时八万四千人即於座上远尘离垢得法眼净
359a05	犹若素质易为受色见法得果真实无欺成就无畏
359a06	即白佛言我等欲於如来法中净修梵行佛言善来
359a07	比丘吾法清净自在修行以尽苦际时八万四千人
359a08	即得具戒具戒未久世尊以三事教化一曰神足二
359a09	曰观他心三曰教戒即得无漏心解脱生无疑智前
359a10	八万四千人闻佛於鹿野苑中转无上法轮沙门婆
359a11	罗门诸天魔梵及餘世人所不能转即诣槃头城毗
359a12	婆尸佛所头面礼足却坐一面佛时颂曰
359a13	如求救头然速疾求灭处彼人亦如是
359a14	速诣於如来
359a15	时佛为说法亦复如是尔时槃头城有三十四万八
359a16	千大比丘众踬沙比丘骞荼比丘於大众中上昇虚
359a17	空身出水火现诸神变而为大众说微妙法尔时如
359a18	来默自思言今此城内乃有三十四万八千大比丘
359a19	众宜遣游行各二人俱在在处处至于六年还来城
359a20	内说具足戒时首陀会天知如来心譬如力士屈伸
359b01	臂顷从彼天没忽然至此於世尊前头面礼足却住
359b02	一面须臾白佛言如是世尊此槃头城内比丘众多
359b03	宜各分布处处游行至於六年乃还此城说具足戒
359b04	我当拥护令无伺求得其便者尔时如来闻此天语
359b05	默然可之时首陀会天见佛默然许可即礼佛足忽
359b06	然不现还至天上其去未久佛告诸比丘今此城内
359b07	比丘众多宜各分布游行教化至六年已还集说戒
359b08	时诸比丘受佛教巳执持衣钵礼佛而去佛时颂曰
359b09	佛遣无乱众无欲无恋著威如金翅鸟
359b10	如鹤舍空池
359b11	时首陀会天於一年后告诸比丘汝等游行巳过一
359b12	年餘有五年汝等当知讫六年巳还城说戒如是至
359b13	于六年天复告言六年巳满当还说戒时诸比丘闻
359b14	天语巳摄持衣钵还槃头城至鹿野苑毗婆尸佛所
359b15	头面礼足却坐一面佛时颂曰
359b16	如象善调随意所至大众如是随教而还
359b17	尔时如来於大众前上昇虚空结跏趺坐讲说戒经
359b18	忍辱为第一佛说涅槃最不以除须发害他为沙门
359b19	时首陀会天去佛不远以偈赞曰
359b20	如来大智微妙独尊止观具足成最正觉
360a01	愍群生故在世成道以四真谛为声闻说
360a02	苦与苦因灭苦之谛贤圣八道到安隐处
360a03	毗婆尸佛出现于世在大众中如日光曜
360a04	说此偈巳忽然不现尔时世尊告诸比丘我自思念
360a05	昔一时於罗阅城耆阇崛山时生是念我所生处无
360a06	所不遍唯除首陀会天设生彼天则不还此我时比
360a07	丘复生是念我欲至无造天上时我如壮士屈伸臂
360a08	顷於此间没现於彼天时彼诸天见我至彼头面作
360a09	礼於一面立而白我言我等皆是毗婆尸如来弟子
360a10	从彼佛化故来生此具说彼佛因缘本末又尸弃佛
360a11	毗舍婆佛拘留孙佛拘那含佛迦叶佛释迦牟尼佛
360a12	皆是我师我从受化故来生此亦说诸佛因缘本末
360a13	至生阿迦尼吒诸天亦复如是佛时颂曰
360a14	譬如力士屈伸臂顷我以神足至无造天
360a15	第七大仙降伏二魔无极天见叉手敬礼
360a16	如昼度树释师远闻相好具足到善见天
360a17	犹如莲华水所不著世尊无染至大善见
360a18	如日初出净无尘翳明若秋月诣一究竟
360a19	此五居处众生行净心净故来诣无烦恼
360a20	净心而来为佛弟子舍离染取乐於无取
360b01	见法决定毗婆尸子净心善来诣大仙人
360b02	尸弃佛子无垢无为以净心来诣离有尊
360b03	毗舍婆子诸根具足净心诣我如日照空
360b04	拘留孙子舍离诸欲净心诣我妙光焰盛
360b05	拘那含子无垢无为净心诣我光如月满
360b06	迦叶弟子诸根具足净心诣我如北天念
360b07	不能大仙神足第一以坚固心为佛弟子
360b08	净心而来为佛弟子礼敬如来具启人尊
360b09	所生成道名姓种族知见深法成无上道
360b10	比丘静处离于尘垢精勤不懈断诸有结
360b11	此是诸佛本末因缘释迦如来之所演说
360b12	佛说此大因缘经巳诸比丘闻佛所说欢喜奉行
360b13	佛说长阿含经卷第一`

export const lca_da_1=`
	第一分
	佛说长阿含经卷第一
	第一经   大本经
1	如是我闻： 
2	一时，佛在舍卫国只树花林窟，与大比丘众千二百五十人俱。
3	时，诸比丘于乞食后集花林堂，各共议言：「诸贤比丘！唯无上尊为最奇特，神通远达，威力弘大，乃知过去无数诸佛，入于涅盘，断诸结使，消灭戏论。
	又知彼佛劫数多少、名号、姓字、所生种族、其所饮食、寿命修短、所更苦乐。
	又知彼佛有如是戒、有如是法、有如是慧、有如是解、有如是住。
	云何诸贤！如来为善别法性，知如是事，为诸天来语，乃知此事？」
4	尔时，世尊在闲静处，天耳清净，闻诸比丘作如是议，卽从座起，诣花林堂，就座而坐。
5	尔时，世尊知而故问，谓：「诸比丘！汝等集此，何所语议？」
6	时，诸比丘具以事答。
7	尔时，世尊告诸比丘：「善哉！善哉！汝等以平等信，出家修道，诸所应行，凡有二业：一曰贤圣讲法，二曰贤圣默然。
	汝等所论，正应如是。
	如来神通，威力弘大，尽知过去无数劫事，以能善解法性故知，亦以诸天来语故知。」
8	佛时颂曰： 
	   「比丘集法堂，讲说贤圣论；如来处静室，天耳尽闻知。
	    佛日光普照，分别法界义；亦知过去事，三佛般泥洹。
	    名号姓种族，受生分亦知；随彼之处所，净眼皆记之。
	    诸天大威力，容貌甚端严；亦来启告我，三佛般泥洹。
	    记生名号姓，哀鸾音尽知；无上天人尊，记于过去佛。」
9	又告诸比丘：「汝等欲闻如来识宿命智，知于过去诸佛因缘不？我当说之。」
10	时，诸比丘白佛言：「世尊！今正是时，愿乐欲闻。善哉！世尊！以时讲说，当奉行之。」
11	佛告诸比丘：「谛听！谛听！善思念之，吾当为汝分别解说。」
12	时，诸比丘受教而听。
13a	佛告诸比丘：「过去九十一劫，时世有佛名毗婆尸如来、至真，出现于世。
	复次，比丘！过去三十一劫，有佛名尸弃如来、至真，出现于世。
	复次，比丘！卽彼三十一劫中，有佛名毗舍婆如来、至真，出现于世。复次，比丘！此贤劫中有佛名拘楼孙；
	又名拘那含；
	又名迦叶。
	我今亦于贤劫中成最正觉。」
13b	佛时颂曰：
	   「过九十一劫，有毗婆尸佛；次三十一劫，有佛名尸弃；
	    卽于彼劫中，毗舍如来出。今此贤劫中，无数那维岁，
	    有四大仙人，愍众生故出：拘楼孙、那含、迦叶、释迦文。」
14a	「汝等当知，毗婆尸佛时，人寿八万岁。
	尸弃佛时，人寿七万岁。
	毗舍婆佛时，人寿六万岁。
	拘楼孙佛时，人寿四万岁。
	拘那含佛时，人寿三万岁。
	迦叶佛时，人寿二万岁。
	我今出世，人寿百岁，少出多减。」
14b	佛时颂曰：
	   「毗婆尸时人，寿八万四千；尸弃佛时人，寿命七万岁；
	    毗舍婆时人，寿命六万岁；拘楼孙时人，寿命四万岁；
	    拘那含时人，寿命三万岁；迦叶佛时人，寿命二万岁；
	    如我今时人，寿命不过百。」
15a	「毗婆尸佛，出刹利种，姓拘利若；
	尸弃佛、毗舍婆佛，种、姓亦尔。
	拘楼孙佛，出婆罗门种，姓迦叶；
	拘那含佛、迦叶佛，种、姓亦尔。
	我今如来、至真，出刹利种，姓名曰瞿昙。」
15b	佛时颂曰：
	   「毗婆尸如来，尸弃、毗舍婆，此三等正觉，出拘利若姓。
	    自余三如来，出于迦叶姓。我今无上尊，导御诸众生；
	    天人中第一，勇猛姓瞿昙。前三等正觉，出于刹利种；
	    其后三如来，出婆罗门种；我今无上尊，勇猛出刹利。」
16a	「毗婆尸佛坐波波罗树下成最正觉，
	尸弃佛坐分陀利树下成最正觉，
	毗舍婆佛坐婆罗树下成最正觉，
	拘楼孙佛坐尸利沙树下成最正觉，
	拘那含佛坐优昙婆罗树下成最正觉，
	迦叶佛坐尼拘类树下成最正觉。
	我今如来、至真，坐钵多树下成最正觉。」
16b	佛时颂曰：
	   「毗婆尸如来，往诣波罗树；卽于彼处所，得成最正觉。
	    尸弃分陀树，成道灭有原。毗舍婆如来，坐婆罗树下；
	    获解脱知见，神足无所碍。拘楼孙如来，坐尸利沙树；
	    一切智清净，无染无所着。拘那含牟尼，坐乌暂树下；
	    卽于彼处所，灭诸贪忧恼。迦叶如来坐，尼拘类树下；
	    卽于彼处所，除灭诸有本。我今释迦文，坐于钵多树。
	    如来十力尊，断灭诸结使；摧伏众魔怨，在众演大明。
	    七佛精进力，放光灭暗冥；各各坐诸树，于中成正觉。」
17a	「毗婆尸如来三会说法，初会弟子有十六万八千人，二会弟子有十万人，三会弟子有八万人。
	尸弃如来亦三会说法，初会弟子有十万人，二会弟子有八万人，三会弟子有七万人。
	毗舍婆如来二会说法，初会弟子有七万人，次会弟子有六万人。
	拘楼孙如来一会说法，弟子四万人。
	拘那含如来一会说法，弟子三万人。
	迦叶如来一会说法，弟子二万人。
	我今一会说法，弟子千二百五十人。」
17b	佛时颂曰：
	   「毗婆尸名观，智慧不可量；遍见无所畏，三会弟子众。
	    尸弃光无动，能灭诸结使；无量大威德，无能测量者；
	    彼佛亦三会，弟子普共集。毗舍婆断结，大仙人要集；
	    名闻于诸方，妙法大名称；二会弟子众，普演深奥义。
	    拘楼孙一会，哀愍疗诸苦；导师化众生，一会弟子众。
	    拘那含如来，无上亦如是；紫磨金色身，容貌悉具足；
	    一会弟子众，普演微妙法。迦叶一一毛，一心无乱想；
	    一语不烦重，一会弟子众。能仁意寂灭，释种沙门上；
	    天中天最尊，我一会弟子。彼会我现义，演布清净教；
	    心常怀欢喜，漏尽尽后有。毗婆、尸弃三，毗舍婆佛二，
	    四佛各各一，仙人会演说。」
18a	「时，毗婆尸佛有二弟子：一名骞荼，二名提舍，诸弟子中最为第一。
	尸弃佛有二弟子：一名阿毗浮，二名三婆婆，诸弟子中最为第一。
	毗舍婆佛有二弟子：一名扶游，二名郁多摩，诸弟子中最为第一。
	拘楼孙佛有二弟子：一名萨尼，二名毗楼，诸弟子中最为第一。
	拘那含佛有二弟子：一名舒盘那，二名郁多楼，诸弟子中最为第一。
	迦叶佛有二弟子：一名提舍，二名婆罗婆，诸弟子中最为第一。
	今我二弟子：一名舍利弗，二名目揵连，诸弟子中最为第一。」
18b	佛时颂曰：
	   「骞荼、提舍等，毗婆尸弟子；阿毗浮、三婆，尸弃佛弟子。
	    扶游、郁多摩，弟子中第一，二俱降魔怨，毗舍婆弟子。
	    萨尼、毗楼等，拘楼孙弟子；舒盘、郁多楼，拘那含弟子；
	    提舍、婆罗婆，迦叶佛弟子；舍利弗、目连，是我第一子。」
19a	「毗婆尸佛有执事弟子，名曰无忧。尸弃佛执事弟子，名曰忍行。毗舍婆佛有执事弟子，名曰寂灭。拘楼孙佛有执事弟子，名曰善觉。拘那含佛有执事弟子，名曰安和。迦叶佛有执事弟子，名曰善友。我执事弟子，名曰阿难。」
19b	佛时颂曰：
	   「无忧与忍行，寂灭及善觉，安和、善友等，阿难为第七。
	    此为佛侍者，具足诸义趣；昼夜无放逸，自利亦利他。
	    此七贤弟子，侍七佛左右；欢喜而供养，寂然归灭度。」
20a	「毗婆尸佛有子，名曰方膺。
	尸弃佛有子，名曰无量。
	毗舍婆佛有子，名曰妙觉。
	拘楼孙佛有子，名曰上胜。
	拘那含佛有子，名曰导师。
	迦叶佛有子，名曰集军。
	今我有子，名曰罗睺罗。」
20b	佛时颂曰：
	   「方膺、无量子，妙觉及上胜，导师、集军等，罗睺罗第七。
	    此诸豪贵子，绍继诸佛种；爱法好施惠，于圣法无畏。」
21a	「毗婆尸佛父名盘头，刹利王种，母名盘头婆提，王所治城名曰盘头婆提。」
21b	佛时颂曰：
	   「遍眼父盘头，母盘头婆提；盘头婆提城，佛于中说法。」
22a	「尸弃佛父名曰明相，刹利王种，母名光曜，王所治城名曰光相。」22b	佛时颂曰：
	   「尸弃父明相，母名曰光曜；于光相城中，威德降外敌。
23a	「毗舍婆佛父名善灯，刹利王种，母名称戒，王所治城名曰无喻。」23b	佛时颂曰：
	   「毗舍婆佛父，善灯刹利种；母名曰称戒，城名曰无喻。」
24a	「拘楼孙佛父名祀得，婆罗门种，母名善枝，王名安和，随王名故城名安和。」
24b	佛时颂曰：
	   「祀得婆罗门，母名曰善枝；王名曰安和，居在安和城。」
25a	「拘那含佛父名大德，婆罗门种，母名善胜，是时王名清净，随王名故城名清净。」
25b	佛时颂曰：
	   「大德婆罗门，母名曰善胜；王名曰清净，居在清净城。」
26a	「迦叶佛父名曰梵德，婆罗门种，母名曰财主，时王名汲毗，王所治城名波罗[木*奈]。」
26b	佛时颂曰：
	   「梵德婆罗门，母名曰财主；时王名汲毗，在波罗[木*奈]城。」
27a	「我父名净饭，刹利王种，母名大化，王所治城名迦毗罗卫。」27b	佛时颂曰：
	   「父刹利净饭，母名曰大化；土广民丰饶，我从彼而生。」
28	「此是诸佛因缘、名号、种族、所出生处，何有智者，闻此因缘而不欢喜起爱乐心？」
29	尔时，世尊告诸比丘：「吾今欲以宿命智说过去佛事，汝欲闻不？」
30	诸比丘对曰：「今正是时，愿乐欲闻！」
31a	佛告诸比丘：「谛听！谛听！善思念之，吾当为汝分别解说。比丘！当知诸佛常法：毗婆尸菩萨从兜率天降神母胎，从右脇入，正念不乱。
	当于尔时，地为震动，放大光明，普照世界，日月所不及处皆蒙大明，幽冥众生，各相覩见，知其所趣。
	时，此光明复照魔宫，诸天、释、梵、沙门、婆罗门及余众生普蒙大明，诸天光明自然不现。」
31b	佛时颂曰：
	   「密云聚虚空，电光照天下，毗婆尸降胎，光明照亦然；
	    日月所不及，莫不蒙大明，处胎净无秽，诸佛法皆然。」
32a	「诸比丘！当知诸佛常法：毗婆尸菩萨在母胎时，专念不乱，有四天子，执戈矛侍护其人，人与非人不得侵娆，此是常法。」
32b	佛时颂曰：
	   「四方四天子，有名称威德，天帝释所遣，善守护菩萨。
	    手常执戈矛，卫护不去离，人非人不娆，此诸佛常法。
	    天神所拥护，如天女卫天，眷属怀欢喜，此诸佛常法。」
33a	又告比丘：「诸佛常法：毗婆尸菩萨从兜率天降神母胎，专念不乱，母身安隐，无众恼患，智慧增益。母自观胎，见菩萨身诸根具足，如紫磨金，无有瑕秽。犹如有目之士观净琉璃，内外清彻，无众障翳。诸比丘！此是诸佛常法。」
33b	尔时，世尊而说偈言：
	   「如净琉璃珠，其明如日月；仁尊处母胎，其母无恼患。
	    智慧为增益，观胎如金像；母怀妊安乐，此诸佛常法。」
34a	佛告比丘：「毗婆尸菩萨从兜率天降神母胎，专念不乱，母心清净，无众欲想，不为淫火之所烧然，此是诸佛常法。」
34b	尔时，世尊而说偈言：
	   「菩萨住母胎，天中天福成；其母心清净，无有众欲想。
	    舍离诸淫欲，不染不亲近；不为欲火燃，诸佛母常净。」
35a	佛告比丘：「诸佛常法：毗婆尸菩萨从兜率天降神母胎，专念不乱，其母奉持五戒，梵行清净，笃信仁爱，诸善成就，安乐无畏，身坏命终，生忉利天，此是常法。」
35b	尔时，世尊而说偈言：
	   「持人中尊身，精进、戒具足，后必受天身，此缘名佛母。」
36a	佛告比丘：「诸佛常法：毗婆尸菩萨当其生时，从右脇出，地为震动，光明普照。始入胎时，暗冥之处，无不蒙明，此是常法。」
36b	尔时，世尊而说偈言：
	   「太子生地动，大光靡不照，此界及余界，上下与诸方。
	    放光施净目，具足于天身，以欢喜净音，转称菩萨名。」
37a	佛告比丘：「诸佛常法：毗婆尸菩萨当其生时，从右脇出，专念不乱。时，菩萨母手攀树枝，不坐不卧。时，四天子手捧香水，于母前立言：『唯然，天母！今生圣子，勿怀忧戚。』此是常法。」
37b	尔时，世尊而说偈言：
	   「佛母不坐卧，住戒修梵行；生尊不懈怠，天人所奉侍。」
38a	佛告比丘：「诸佛常法：毗婆尸菩萨当其生时，从右脇出，专念不乱，其身清净，不为秽恶之所污染。犹如有目之士，以净明珠投白缯上，两不相污，二俱净故。菩萨出胎亦复如是，此是常法。」
38b	尔时，世尊而说偈言：
	   「犹如净明珠，投缯不染污；菩萨出胎时，清净无染污。」
39a	佛告比丘：「诸佛常法：毗婆尸菩萨当其生时，从右脇出，专念不乱。从右脇出，堕地行七步，无人扶持，遍观四方，举手而言：『天上天下唯我为尊，要度众生生老病死。』此是常法。」
39b	尔时，世尊而说偈言：
	   「犹如师子步，遍观于四方；堕地行七步，人师子亦然。
	    又如大龙行，遍观于四方；堕地行七步，人龙亦复然。
	    两足尊生时，安行于七步；观四方举声，当尽生死苦。
	    当其初生时，无等等与等，自观生死本，此身最后边。」
40a	佛告比丘：「诸佛常法：毗婆尸菩萨当其生时，从右脇出，专念不乱，二泉涌出一温一冷，以供澡浴，此是常法。」
40b	尔时，世尊而说偈言：
	   「两足尊生时，二泉自涌出；以供菩萨用，遍眼浴清净。
	    二泉自涌出，其水甚清净；一温一清冷，以浴一切智。」
41	「太子初生，父王盘头召集相师及诸道术，令观太子，知其吉凶。42	时，诸相师受命而观，卽前披衣，见有具相，占曰：『有此相者，当趣二处，必然无疑。若在家者，当为转轮圣王，王四天下，四兵具足，以正法治，无有偏枉，恩及天下，七宝自至，千子勇健，能伏外敌，兵仗不用，天下太平。若出家学道，当成正觉，十号具足。』
43a	时，诸相师卽白王言：『王所生子，有三十二相，当趣二处，必然无疑。在家当为转轮圣王；若其出家，当成正觉，十号具足。』」43b	佛时颂曰：
	   「百福太子生，相师之所记，如典记所载，趣二处无疑。
	    若其乐家者，当为转轮王，七宝难可获，为王宝自至。
	    真金千辐具，周匝金辋持，转能飞遍行，故名为天轮。
	    善调七支住，高广白如雪，能善飞虚空，名第二象宝。
	    马行周天下，朝去暮还食，朱髦孔雀咽，名为第三宝。
	    清净琉璃珠，光照一由旬，照夜明如昼，名为第四宝。
	    色声香味触，无有与等者，诸女中第一，名为第五宝。
	    献王琉璃宝，珠玉及众珍，欢喜而贡奉，名为第六宝。
	    如转轮王念，军众速来去，捷疾如王意，名为第七宝。
	    此名为七宝，轮、象、马纯白、居士、珠、女宝、典兵宝为七。
	    观此无有厌，五欲自娱乐，如象断羁绊，出家成正觉。
	    王有如是子，二足人中尊，处世转法轮，道成无懈怠。」
44	「是时，父王殷勤再三，重问相师：『汝等更观太子三十二相，斯名何等？』
45a	时诸相师即披太子衣，说三十二相：
	『一者、足安平，足下平满，蹈地安隐。二者、足下相轮，千辐成就，光光相照。三者、手足网缦，犹如鹅王。四者、手足柔软，犹如天衣。五者、手足指纎，长无能及者。六者、足跟充满，观视无厌。七者、鹿䏝肠，上下[月*庸]直。八者、钩锁骨，骨节相钩，犹如锁连。九者、阴马藏。十者、平立垂手过膝。十一、一一毛孔一毛生，其毛右旋，绀琉璃色。十二、毛生右旋，绀色仰靡。十三、身黄金色。十四、皮肤细软，不受尘秽。十五、两肩齐亭，充满圆好。十六、胸有万字。十七、身长倍人。十八、七处平满。十九、身长广等，如尼拘类树。二十、颊车如师子。二十一、胸膺方整如师子。二十二、口四十齿。二十三、方整齐平。二十四、齿密无间。二十五、齿白鲜明。二十六、咽喉清净，所食众味，无不称适。二十七、广长舌，左右[舌*氐]耳。二十八、梵音清彻。二十九、眼绀青色。三十、眼如牛王，眼上下俱眴。三十一、眉间白毫柔软细泽，引长一寻，放则右旋螺如真珠。三十二、顶有肉髻。
	是为三十二相。』」
45b	卽说颂曰：
	   「善住柔软足，不蹈地迹现。千辐相庄严，光色靡不具。
	    如尼拘类树，纵广正平等。如来未曾有，祕密阴马藏。
	    金宝庄严身，众相互相映。虽顺俗流行，尘土亦不污。
	    天色极柔软，天盖自然覆。梵音、身紫金，如华始出池。
	    王以问相师，相师敬报王。称赞菩萨相，举身光明具。
	    手足诸支节，中外靡不现。食味尽具足，身正不倾斜。
	    足下轮相见，其音如哀鸾。[月*庸][月*坒]形相具，宿业之所成。
	    臂肘圆满好，眉目甚端严。人中师子尊，威力最第一。
	    其颊车方整，卧脇如师子。齿方整四十，齐密中无间。
	    梵音未曾有，远近随缘到。平立不倾身，二手摩扪膝。
	    手齐整柔软，人尊美相具。一孔一毛生，手足网缦相。
	    肉髻、目绀青，眼上下俱眴。两肩圆充满，三十二相具。
	    足跟无高下，鹿䏝肠纤[月*庸]。天中天来此，如象绝羁绊；
	    解脱众生苦，处生老病死。以慈悲心故，为说四真谛；
	    开演法句义，令众奉至尊。」
46a	佛告比丘：「毗婆尸菩萨生时，诸天在上，于虚空中手执白盖宝扇，以障寒暑、风雨、尘土。」
46b	佛时颂曰：
	   「人中未曾有，生于二足尊；诸天怀敬养，奉宝盖宝扇。」
47a	「尔时，父王给四乳母：
	一者、乳哺，二者、澡浴，三者、涂香，四者、娱乐。
	欢喜养育，无有懈倦。」
47b	于是颂曰：
	   「乳母有慈爱，子生卽付养；一乳哺一浴，二涂香娱乐。
	    世间最妙香，以涂人中尊。」
48a	「为童子时，举国士女视无厌足。」
48b	于是颂曰：
	   「多人所敬爱，如金像始成；男女共谛观，视之无厌足。」
49a	「为童子时，举国士女众共怀抱，如观宝华。」
49b	于是颂曰：
	   「二足尊生时，多人所敬爱；展转共怀抱，如观宝花香。」
50a	「菩萨生时，其目不眴，如忉利天。以不眴故，名毗婆尸。」
50b	于是颂曰：
	   「天中天不眴，犹如忉利天；见色而正观，故号毗婆尸。」
51a	「菩萨生时，其声清彻，柔软和雅，如迦罗频伽鸟声。」
51b	于是颂曰：
	   「犹如雪山鸟，饮华汁而鸣；其彼二足尊，声清彻亦然。」
52a	「菩萨生时，眼能彻视见一由旬。」
52b	于是颂曰：
	   「清净业行报，受天妙光明；菩萨目所见，周遍一由旬。」
53a	「菩萨生时，年渐长大，在天正堂，以道开化，恩及庶民，名德远闻。」
53b	于是颂曰：
	   「童幼处正堂，以道化天下；决断众事务，故号毗婆尸。
	    清净智广博，甚深犹大海；悦可于羣生，使智慧增广。」
54a	「于时，菩萨欲出游观，告敕御者严驾宝车，诣彼园林，巡行游观。御者卽便严驾讫已，还白：『今正是时。』
	太子卽乘宝车诣彼园观。
	于其中路见一老人，头白齿落，面皱身偻，拄杖羸步，喘息而行。
	太子顾问侍者：『此为何人？』
	答曰：『此是老人。』
	又问：『何如为老？』
	答曰：『夫老者生寿向尽，余命无几，故谓之老。』
	太子又问：『吾亦当尔，不免此患耶？』
	答曰：『然，生必有老，无有豪贱。』
	于是，太子怅然不悦，卽告侍者回驾还宫，静默思惟，念此老苦，吾亦当有。」
54b	佛于是颂曰：
	   「见老命将尽，拄杖而羸步；菩萨自思惟，吾未免此难。」
55a	「尔时，父王问彼侍者：『太子出游，欢乐不耶？』
	答曰：『不乐。』
	又问其故，答曰：『道逢老人，是以不乐。』
	尔时，父王默自思念：昔日相师占相太子，言当出家，今者不悦，得无尔乎？当设方便，使处深宫，五欲娱乐，以悦其心，令不出家。
	卽便严饰宫馆，简择婇女以娱乐之。」
55b	佛于是颂曰：
	   「父王闻此言，方便严宫馆；增益以五欲，欲使不出家。」
56a	「又于后时，太子复命御者严驾出游。
	于其中路逢一病人，身羸腹大，面目黧黑，独卧粪秽，无人瞻视，病甚苦毒，口不能言。顾问御者：『此为何人？』
	答曰：『此是病人。』
	问曰：『何如为病？』
	答曰：『病者，众痛迫切，存亡无期，故曰病也。』
	又曰：『吾亦当尔，未免此患耶？』
	答曰：『然，生则有病，无有贵贱。』
	于是，太子怅然不悦，卽告御者回车还宫。静默思惟，念此病苦，吾亦当尔。」
56b	佛于是颂曰：
	   「见彼久病人，颜色为衰损；静默自思惟，吾未免此患。」
57a	「尔时，父王复问御者：『太子出游，欢乐不耶？』
	答曰：『不乐。』
	又问其故，答曰：『道逢病人，是以不乐。』
	于是父王默然思惟：昔日相师占相太子，言当出家，今日不悦，得无尔乎？吾当更设方便，增诸伎乐，以悦其心，使不出家。
	卽复严饰宫馆，简择婇女以娱乐之。」
57b	佛于是颂曰：
	   「色声香味触，微妙可悦乐，菩萨福所致，故娱乐其中。」
58a	「又于异时，太子复敕御者严驾出游。
	于其中路逢一死人，杂色绘幡前后导引，宗族亲里悲号哭泣，送之出城。
	太子复问：『此为何人？』
	答曰：『此是死人。』
	问曰：『何如为死？』
	答曰：『死者，尽也。风先火次，诸根坏败，存亡异趣，室家离别，故谓之死。』
	太子又问御者：『吾亦当尔，不免此患耶？』
	答曰：『然，生必有死，无有贵贱。』
	于是，太子怅然不悦，卽告御者回车还宫，静默思惟，念此死苦，吾亦当然。」
58b	佛时颂曰：
	   「始见有人死，知其复更生；静默自思惟，吾未免此患。」
59a	「尔时，父王复问御者：『太子出游，欢乐不耶？』
	答曰：『不乐。』
	又问其故，答曰：『道逢死人，是故不乐。』
	于是父王默自思念：昔日相师占相太子，言当出家，今日不悦，得无尔乎？吾当更设方便，增诸伎乐以悦其心，使不出家。
	卽复严饰宫馆，简择婇女以娱乐之。」
59b	佛于是颂曰：
	   「童子有名称，婇女众围遶；五欲以自娱，如彼天帝释。」
60	「又于异时，复敕御者严驾出游。
	于其中路逢一沙门，法服持钵，视地而行。卽问御者：『此为何人？』御者答曰：『此是沙门。』
	又问：『何谓沙门？』
	答曰：『沙门者，舍离恩爱，出家修道，摄御诸根，不染外欲，慈心一切，无所伤害，逢苦不戚，遇乐不欣，能忍如地，故号沙门。』
	太子曰：『善哉！此道真正永绝尘累，微妙清虚，唯是为快。』
	卽敕御者回车就之。
61	尔时，太子问沙门曰：『剃除须发，法服持钵，何所志求？』
	沙门答曰：『夫出家者，欲调伏心意，永离尘垢，慈育羣生，无所侵娆，虚心静寞，唯道是务。』
	太子曰：『善哉！此道最真。』
	寻敕御者：『賷吾宝衣并及乘轝，还白大王，我卽于此剃除须发，服三法衣，出家修道。所以然者，欲调伏心意，舍离尘垢，清净自居，以求道术。』
	于是，御者卽以太子所乘宝车及与衣服还归父王。
62	太子于后卽剃除须发，服三法衣，出家修道。」
63	佛告比丘：「太子见老、病人，知世苦恼；又见死人，恋世情灭；及见沙门，廓然大悟。下宝车时，步步中间转远缚着，是真出家，是真远离。
64a	时，彼国人闻太子剃除须发，法服持钵，出家修道，咸相谓言：『此道必真，乃令太子舍国荣位，捐弃所重。』
	于时，国中八万四千人往就太子，求为弟子，出家修道。」
64b	佛时颂曰：
	   「撰择深妙法，彼闻随出家；离于恩爱狱，无有众结缚。」
65	「于时，太子卽便纳受，与之游行，在在教化。从村至村，从国至国，所至之处，无不恭敬四事供养。
	菩萨念言：吾与大众，游行诸国，人间愦闹，此非我宜。何时当得离此羣众，闲静之处以求真道，寻获志愿，于闲静处专精修道？
	复作是念：众生可愍，常处暗冥，受身危脆，有生、有老、有病、有死。众苦所集，死此生彼，从彼生此。缘此苦阴，流转无穷，我当何时晓了苦阴，灭生、老、死？
66a	复作是念：生死何从？何缘而有？
	卽以智慧观察所由，从生有老死，生是老死缘；
	生从有起，有是生缘；
	有从取起，取是有缘；
	取从爱起，爱是取缘；
	爱从受起，受是爱缘；
	受从触起，触是受缘；
	触从六入起，六入是触缘；
	六入从名色起，名色是六入缘；
	名色从识起，识是名色缘；
	识从行起，行是识缘；
	行从痴起，痴是行缘。
	是为缘痴有行，缘行有识，缘识有名色，缘名色有六入，缘六入有触，缘触有受，缘受有爱，缘爱有取，缘取有有，缘有有生，缘生有老、病、死、忧、悲、苦恼，此苦盛阴，缘生而有，是为苦集。
	菩萨思惟苦集阴时，生智、生眼、生觉、生明、生通、生慧、生证。
66b	于时，菩萨复自思惟：何等无故老死无？何等灭故老死灭？
	卽以智慧观察所由，生无故老死无，生灭故老死灭；
	有无故生无，有灭故生灭；
	取无故有无，取灭故有灭；
	爱无故取无，爱灭故取灭；
	受无故爱无，受灭故爱灭；
	触无故受无，触灭故受灭；
	六入无故触无，六入灭故触灭；
	名色无故六入无，名色灭故六入灭；
	识无故名色无，识灭故名色灭；
	行无故识无，行灭故识灭；
	痴无故行无，痴灭故行灭。
	是为痴灭故行灭，行灭故识灭，识灭故名色灭，名色灭故六入灭，六入灭故触灭，触灭故受灭，受灭故爱灭，爱灭故取灭，取灭故有灭，有灭故生灭，生灭故老、死、忧、悲、苦恼灭。
	菩萨思惟苦阴灭时，生智、生眼、生觉、生明、生通、生慧、生证。
67a	尔时，菩萨逆顺观十二因缘，如实知，如实见已，卽于座上成阿耨多罗三藐三菩提。」
67b	佛时颂曰：
	   「此言众中说，汝等当善听，过去菩萨观，本所未闻法。
	    老死从何缘？因何等而有？如是正观已，知其本由生。
	    生本由何缘？因何事而有？如是思惟已，知生从有起。
	    取彼取彼已，展转更增有；是故如来说，取是有因缘。
	    如众秽恶聚，风吹恶流演；如是取相因，因爱而广普。
	    爱由于受生，起苦罗网本；以染着因缘，苦乐共相应。
	    受本由何缘？因何而有受？如是思惟已，知受由触生。
	    触本由何缘？因何而有触？如是思惟已，触由六入生。
	    六入本何缘？因何有六入？如是思惟已，六入名色生。
	    名色本何缘？因何有名色？如是思惟已，名色从识生。
	    识本由何缘？因何而有识？如是思惟已，知识从行生。
	    行本由何缘？因何而有行？如是思惟已，知行从痴生。
	    如是因缘者，名为实义因，智慧方便观，能见因缘根。
	    苦非贤圣造，亦非无缘有，是故变易苦，智者所断除。
	    若无明灭尽，是时则无行；若无有行者，则亦无有识；
	    若识永灭者，亦无有名色；名色既已灭，卽无有诸入；
	    若诸入永灭，则亦无有触；若触永灭者，则亦无有受；
	    若受永灭者，则亦无有爱；若爱永灭者，则亦无有取；
	    若取永灭者，则亦无有有；若有永灭者，则亦无有生；
	    若生永灭者，无老病苦阴；一切都永尽，智者之所说。
	    十二缘甚深，难见难识知；唯佛能善觉，因是有是无。
	    若能自观察，则无有诸入；深见因缘者，更不外求师。
	    能于阴、界、入，离欲无染者；堪受一切施，净报施者恩。
	    若得四辩才，获得决定证；能解众结缚，断除无放逸。
	    色受想行识，犹如朽故车；能谛观此法，则成等正觉。
	    如鸟游虚空，东西随风游；菩萨断众结，如风靡轻衣。
	    毗婆尸闲静，观察于诸法；老死何缘有？从何而得灭？
	    彼作是观已，生清净智慧；知老死由生，生灭老死灭。」
68a	「毗婆尸佛初成道时，多修二观：一曰安隐观，二曰出离观。」68b	佛于是颂曰：
	   「如来无等等，多修于二观；安隐及出离，仙人度彼岸。
	    其心得自在，断除众结使；登山观四方，故号毗婆尸。
	    大智光除冥，如以镜自照；为世除忧恼，尽生老死苦。」
69	「毗婆尸佛于闲静处复作是念：我今已得此无上法，甚深微妙，难解难见，息灭、清净，智者所知，非是凡愚所能及也。斯由众生异忍、异见、异受、异学，依彼异见，各乐所求，各务所习。是故于此甚深因缘，不能解了，然爱尽涅盘，倍复难知，我若为说，彼必不解，更生触扰。作是念已，卽便默然不复说法。
70	时，梵天王知毗婆尸如来所念，卽自思惟：『今此世间便为败坏，甚可哀愍。毗婆尸佛乃得如此深妙之法，而不欲说。』譬如力士屈伸臂顷，从梵天宫忽然来下，立于佛前，头面礼足，却住一面。
71	时，梵天王右膝着地，叉手合掌白佛言：『唯愿世尊以时说法！今此众生尘垢微薄，诸根猛利，有恭敬心，易可开化，畏怖后世无救之罪，能灭恶法，出生善道。』
72	佛告梵王：『如是！如是！如汝所言，但我于闲静处默自思念：所得正法甚深微妙，若为彼说，彼必不解，更生触扰，故我默然不欲说法。我从无数阿僧只劫，勤苦不懈，修无上行，今始获此难得之法，若为淫、怒、痴众生说者，必不承用，徒自劳疲。此法微妙，与世相反，众生染欲，愚冥所覆，不能信解。梵王！我观如此，是以默然不欲说法。』
73	时，梵天王复重劝请，殷勤恳恻，至于再三：『世尊！若不说法，今此世间便为坏败，甚可哀愍。唯愿世尊以时敷演，勿使众生坠落余趣！』
74	尔时，世尊三闻梵王殷勤劝请，卽以佛眼观视世界，众生垢有厚薄，根有利钝，教有难易。易受教者畏后世罪，能灭恶法，出生善道。譬如优钵罗花、钵头摩华、鸠勿头华、分陀利华，或有始出污泥未至水者，或有已出与水平者，或有出水未敷开者，然皆不为水所染着，易可开敷。世界众生，亦复如是。
75	尔时，世尊告梵王曰：『吾愍汝等，今当开演甘露法门，是法深妙，难可解知，今为信受乐听者说，不为触扰无益者说。』
76	尔时，梵王知佛受请，欢喜踊跃，遶佛三匝，头面礼足，忽然不现。
77	其去未久，是时如来静默自思：我今先当为谁说法？卽自念言：当入盘头城内，先为王子提舍、大臣子骞荼开甘露法门。
78a	于是，世尊如力士屈伸臂顷，于道树忽然不现，至盘头城盘头王鹿野苑中，敷座而坐。」
78b	佛于是颂曰：
	   「如师子在林，自恣而游行；彼佛亦如是，游行无罣碍。」
79	「毗婆尸佛告守苑人曰：『汝可入城，语王子提舍、大臣子骞荼：宁欲知不？毗婆尸佛今在鹿野苑中，欲见卿等，宜知是时。』
	时，彼守苑人受教而行，至彼二人所，具宣佛教。
	二人闻已，卽至佛所，头面礼足，却坐一面。
80	佛渐为说法，示教利喜：施论、戒论、生天之论，欲恶不净，上漏为患，赞叹出离为最微妙清净第一。
	尔时，世尊见此二人心意柔软，欢喜信乐，堪受正法，于是卽为说苦圣谛，敷演开解，分布宣释苦集圣谛、苦灭圣谛、苦出要谛。
81	尔时，王子提舍、大臣子骞荼卽于座上远尘离垢，得法眼净，犹若素质易为受染。
82a	是时，地神卽唱斯言：『毗婆尸如来于盘头城鹿野苑中转无上法轮，沙门、婆罗门、诸天、魔、梵及余世人所不能转。』如是展转，声彻四天王，乃至他化自在天，须臾之顷，声至梵天。」
82b	佛时颂曰：
	   「欢喜心踊跃，称赞于如来，毗婆尸成佛，转无上法轮。
	    初从树王起，往诣盘头城，为骞荼、提舍，转四谛法轮。
	    时骞荼、提舍，受佛教化已，于净法轮中，梵行无有上。
	    彼忉利天众，及以天帝释，欢喜转相告，诸天无不闻。
	    佛出于世间，转无上法轮；增益诸天众，减损阿须伦。
	    升仙名普闻，善智离世边；于诸法自在，智慧转法轮。
	    观察平等法，息心无垢秽；以离生死厄，智慧转法轮。
	    灭苦离诸恶，出欲得自在；离于恩爱狱，智慧转法轮。
	    正觉人中尊，二足尊调御；一切缚得解，智慧转法轮。
	    教化善导师，能降伏魔怨；彼离于诸恶，智慧转法轮。
	    无漏力降魔，诸根定不懈；尽漏离魔缚，智慧转法轮。
	    若学决定法，知诸法无我；此为法中上，智慧转法轮。
	    不以利养故，亦不求名誉；愍彼众生故，智慧转法轮。
	    见众生苦厄，老病死逼迫；为此三恶趣，智慧转法轮。
	    断贪瞋恚痴，拔爱之根源；不动而解脱，智慧转法轮。
	    难胜我已胜，胜已自降伏；已胜难胜魔，智慧转法轮。
	    此无上法轮，唯佛乃能转；诸天魔释梵，无有能转者。
	    亲近转法轮，饶益天人众；此等天人师，得度于彼岸。」
83	「是时，王子提舍、大臣子骞荼见法得果，真实无欺，成就无畏，卽白毗婆尸佛言：『我等欲于如来法中净修梵行。』
84	佛言：『善来，比丘！吾法清净自在，修行以尽苦际。』
85	尔时，二人卽得具戒。具戒未久，如来又以三事示现：一曰神足，二曰观他心，三曰教诫，卽得无漏、心解脱、生死无疑智。
86	尔时，盘头城内众多人民，闻二人出家学道，法服持钵，净修梵行，皆相谓曰：『其道必真，乃使此等舍世荣位，捐弃所重。』
	时，城内八万四千人往诣鹿野苑中毗婆尸佛所，头面礼足，却坐一面。
87	佛渐为说法，示教利喜：施论、戒论、生天之论，欲恶不净，上漏为患，赞叹出离为最微妙清净第一。
	尔时，世尊见此大众心意柔软，欢喜信乐，堪受正法，于是卽为说苦圣谛，敷演开解，分布宣释苦集圣谛、苦灭圣谛、苦出要圣谛。
88	时，八万四千人卽于座上远尘离垢，得法眼净，犹如素质易为受色，见法得果，真实无欺，成就无畏，卽白佛言：『我等欲于如来法中净修梵行。』
89	佛言：『善来，比丘！吾法清净自在，修行以尽苦际。』
90	时，八万四千人卽得具戒。具戒未久，世尊以三事教化：一曰神足，二曰观他心，三曰教诫，卽得无漏、心解脱、生死无疑智现前。91a	八万四千人闻佛于鹿野苑中，转无上法轮，沙门、婆罗门、诸天、魔、梵及余世人所不能转，卽诣盘头城毗婆尸佛所，头面礼足，却坐一面。」
91b	佛时颂曰：
	   「如人救头燃，速疾求灭处；彼人亦如是，速诣于如来。」
92	「时，佛为说法亦复如是。
	尔时，盘头城有十六万八千大比丘众，提舍比丘、骞荼比丘于大众中上升虚空，身出水火，现诸神变，而为大众说微妙法。
93	尔时，如来默自念言：今此城内乃有十六万八千大比丘众，宜遣游行，〔勿〕二人俱在在处处，至于六年，还来城内说具足戒。
94	时，首陀会天知如来心，譬如力士屈伸臂顷，从彼天没，忽然至此，于世尊前，头面礼足，却住一面，须臾白佛言：『如是，世尊！此盘头城内比丘众多，宜各分布，处处游行，至于六年，乃还此城，说具足戒，我当拥护，令无伺求得其便者。』
95	尔时，如来闻此天语，默然可之。
96	时，首陀会天见佛默然许可，卽礼佛足，忽然不现，还至天上。其去未久，佛告诸比丘：『今此城内，比丘众多，宜各分布，游行教化，至六年已，还集说戒。』
97a	时，诸比丘受佛教已，执持衣钵，礼佛而去。」
97b	佛时颂曰：
	   「佛悉无乱众，无欲无恋着；威如金翅鸟，如鹤舍空池。」
98	「时，首陀会天于一年后告诸比丘：『汝等游行已过一年，余有五年。汝等当知，讫六年已，还城说戒。』
	如是至于六年，天复告言：『六年已满，当还说戒。』
99a	时，诸比丘闻天语已，摄持衣钵，还盘头城，至鹿野苑毗婆尸佛所，头面礼足，却坐一面。」
99b	佛时颂曰：
	   「如象善调，随意所之；大众如是，随教而还。」
100	「尔时，如来于大众前上升虚空，结跏趺坐，讲说戒经：忍辱为第一，佛说涅盘最，不以除须发害他为沙门。
101	时，首陀会天去佛不远，以偈颂曰：
	   『如来大智，微妙独尊，止观具足，成最正觉。
	    愍羣生故，在世成道，以四真谛，为声闻说。
	    苦与苦因，灭苦之谛，贤圣八道，到安隐处。
	    毗婆尸佛，出现于世，在大众中，如日光曜。』
	   「说此偈已，忽然不现。」
102a	尔时，世尊告诸比丘：「我自思念；昔一时于罗阅城耆闍崛山，时生是念：我所生处，无所不遍，唯除首陀会天，设生彼天，则不还此。
	我时，比丘！复生是念：我欲至无造天上。时，我如壮士屈伸臂顷，于此间没，现于彼天。时，彼诸天见我至彼，头面作礼，于一面立，而白我言：『我等皆是毗婆尸如来弟子，从彼佛化，故来生此』，具说彼佛因缘本末。
	又尸弃佛、毗舍婆佛、拘楼孙佛、拘那含佛、迦叶佛、释迦牟尼佛，皆是我师，我从受化，故来生此，亦说诸佛因缘本末。
	至生阿迦尼吒诸天，亦复如是。」
102b	佛时颂曰：
	   「譬如力士，屈伸臂顷，我以神足，至无造天。
	    第七大仙，降伏二魔，〔无热天〕见，叉手敬礼。
	    如昼度树，释师远闻，相好具足，到善见天。
	    犹如莲华，水所不着，世尊无染，至大善见。
	    如日初出，净无尘翳，明若秋月，诣一究竟。
	    此五居处，众生行净，心净故来，诣无烦恼。
	    净心而来，为佛弟子，舍离染取，乐于无取。
	    见法决定，毗婆尸子，净心善来，诣大仙人。
	    尸弃佛子，无垢无为，以净心来，诣离有尊。
	    毗舍婆子，诸根具足，净心诣我，如日照空。
	    拘楼孙子，舍离诸欲，净心诣我，妙光焰盛。
	    拘那含子，无垢无为，净心诣我，光如月满。
	    迦叶弟子，诸根具足，净心诣我，如北天念。
	    不乱大仙，神足第一，以坚固心，为佛弟子。
	    净心而来，为佛弟子，礼敬如来，具启人尊。
	    所生成道，名、姓、种族，知见深法，成无上道。
	    比丘静处，离于尘垢，精勤不懈，断诸有结。
	    此是诸佛，本末因缘，释迦如来，之所演说。」
103	佛说此大因缘经已，诸比丘闻佛所说，欢喜奉行！`